{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Bay Eagle",
    "description": "",
    "home_page_url": "https://bayeagle.pages.dev",
    "feed_url": "https://bayeagle.pages.dev/feed.json",
    "user_comment": "",
    "icon": "https://bayeagle.pages.dev/media/website/logo.png",
    "author": {
        "name": "Bay Eagle Editors"
    },
    "items": [
        {
            "id": "https://bayeagle.pages.dev/blood-debts-by-terry-j-benton-walker/",
            "url": "https://bayeagle.pages.dev/blood-debts-by-terry-j-benton-walker/",
            "title": "Blood debts by Terry J. Benton-walker",
            "summary": "Magic, mystery, justice and death; that’s the life of twins Clement and Christina Trudeau. Cristina and Clement discover secrets and bring a broken family together again all with a little magic mixed in. However, magic doesn’t make their hard lives any easier. 30 years ago,&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">     </span><span style=\"font-weight: 400;\">Magic, mystery, justice and death; that’s the life of twins Clement and Christina Trudeau. Cristina and Clement discover secrets and bring a broken family together again all with a little magic mixed in. However, magic doesn’t make their hard lives any easier.</span></p>\n<p><span style=\"font-weight: 400;\">     30 years ago, the queen of the gen magic community was dethroned, and after vanishing she left behind her daughter, and the body of her husband, and a mob on her doorstep. In the present day, her grandchildren Clement (Clem) and Christina (Cris) set out to find who cursed their mother, which put her on her death bed. After the death of their father, their once close-knit bond cracked; in this experience that is unique to the two of them, they develop not only their bond but also piece together the rest of their shattered family.</span></p>\n<p><span style=\"font-weight: 400;\">     Blood Debts by Terry J. Benton-walker is hands down my new favorite book. This book hits so many touchy subject such as racism, homophobia, lynching, slavery and drug usage. These topics aren’t danced around or sugar coated. The fact that these real-life issues are addressed head on makes me enjoy the book so much more. The mystery aspect of this book kept the book intriguing and the end of every page made me want to continue reading. The magic in the book was fun and exciting because the moment you think you’ve got it figured out, you find out you don’t.</span></p>\n<p><span style=\"font-weight: 400;\">     The book shows character growth from start to finish in multiple moments. “I’ve learned that magic can consume you if you allow yourself to become lost in it. But I’m seizing every bit of my power back. I am the granddaughter of a legendary Queen. Magic exists in me, but it is not me. I’ve reset the balance, relit my spark,” is the moment when we see Cristina accept magic back into her life. This is a very important moment in the story because Cris spent the rest of the book scared of what her magic could do. If she had never used magic again, it’s safe to assume that the Savant family would still control the throne (which, in short, would be bad).  There would also still be the wedge between her and her family, especially her and her brother because a huge issue they had was Cris quitting magic even though it was a huge part of her life. It’s clear that at the end of the book Cristina isn’t the same person at the beginning of the book.</span></p>\n<p><span style=\"font-weight: 400;\">     Cris isn’t the only person who experiences character development, Clement gets just as many scenes as his sister. “I do miss my sister. I want to tell her the truth about why I’m spending so much time here, but I can’t. For now, this will have to be my secret. Mine and Jean-Louise’s. I sit on the old couch in the living room, which has begun to contour the shape of my butt. A copy of </span><i><span style=\"font-weight: 400;\">Invisible Man</span></i><span style=\"font-weight: 400;\"> sits on one side of me, but I haven’t been in the mood to read for a while now. I haven’t been in the mood to do much of anything lately. I’ve cried myself to sleep so much that my body has come to expect that release in order to shut off at night,” is Clem's clearest moment of character development. He starts the book as an open person who wasn't scared to say what was on his mind or how he felt, but in the end of the book he has more secrets than I thought his character would be able to keep. This is important because it shows negative “growth” in a character is possible. This was the first time I had seen this type of character development: his growth started positive, but after a situation with his boyfriend all positive growth he made disappeared.</span></p>\n<p><span style=\"font-weight: 400;\">      With or without magic, life is hard for Clement and Cristina. The two face many more trials and tribulations than the average person, but that’s what makes their family special. The only question left to ask is what will book two bring? I can’t wait to find out.</span></p>\n<p><span style=\"font-weight: 400;\">     </span></p>",
            "author": {
                "name": "Ty Horton"
            },
            "tags": [
                   "pop culture, music, &amp; lit",
                   "March 2024"
            ],
            "date_published": "2024-03-20T13:33:27-07:00",
            "date_modified": "2024-03-20T13:46:10-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/electronica-experimentation-in-the-us-today/",
            "url": "https://bayeagle.pages.dev/electronica-experimentation-in-the-us-today/",
            "title": "Electronica Experimentation In the U.S. Today",
            "summary": "Although EDM as an umbrella term has existed since the 1980s, the broad scope of the genre has wildly expanded since the early 2000s. The electronic scene in Los Angeles today is a motley mix of obscurity, from high energy dance music to ethereal, distorted&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">    </span><span style=\"font-weight: 400;\">Although EDM as an umbrella term has existed since the 1980s, the broad scope of the genre has wildly expanded since the early 2000s. The electronic scene in Los Angeles today is a motley mix of obscurity, from high energy dance music to ethereal, distorted rap vocals. Despite the diversity in the Electronica scene, three explosive artists who have risen to prominence over the last decade have grown to truly encapsulate the heart of L.A. Electronica lovers - The Hellp, Snow Strippers, and Yung Lean.</span></p>\n<h2><span style=\"font-weight: 400;\">THE HELLP</span></h2>\n<p><span style=\"font-weight: 400;\">     Over the past decade, L.A. based duo The Hellp have slowly raised a loyal following across the nation. Enamored with their quirky vocals and use of synths to create a drum and bass reminiscent, high energy club experience, their experimental shows have captured the eye of eccentric creatives. From performing at small charity festivals in L.A. to DJing Anna Delvey’s 2023 house arrest party in New York City, the polarizing duo have re-ignited an exploration into deconstructed Electronica that have thrown them into the spotlight. You either love them, or you hate them.</span></p>\n<h2><span style=\"font-weight: 400;\">SNOW STRIPPERS</span></h2>\n<p><span style=\"font-weight: 400;\">     From roaming the cold streets of Detroit to collaborating with Lil Uzi Vert on his 2023 album Pink Tape, Snow Strippers have mixed together loud, overwhelming siren-esk vocals with truly powerful production, putting their bold stamp on the dance and electronic scenes. The duo has morphed at least half a dozen electronic subgenres into their three albums thus far, unapologetically experimenting with synths to create a chaotic, overwhelming listening experience. Their capacity for abrasiveness in their music truly feels like a fresh take, despite their obvious 2010s witch house inspirations (such as Crystal Castles). Snow Strippers popularity in L.A. is certainly on the rise, the city being their #1 listening demographic. Definitely keep an eye out; with their experimentation and presence already, the bold duo is certainly on a steady path to fame.</span></p>\n<h2><span style=\"font-weight: 400;\">YUNG LEAN</span></h2>\n<p><span style=\"font-weight: 400;\">     Over the last decade, Yung Lean has gone from an aspiring Swedish musician to selling out shows around the globe and even playing Coachella in 2023. Yung Lean is unique in that his use of Electronica is almost mystical and other-worldly. While being considered a rapper, his music often flirts with and distorts the typical use of synths in EDM to create an almost out of body experience. His songs feel like journal entries, a huge contrast to the typical upbeat and high energy club music that has become synonymous with Electronica. His incredible success as an artist is felt in Los Angeles, playing 13 shows in LA since 2014.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Sources</span></p>\n<p><span style=\"font-weight: 400;\">Britannica.com</span></p>\n<p><span style=\"font-weight: 400;\">     </span><a href=\"https://www.britannica.com/art/electronic-dance-music\"><span style=\"font-weight: 400;\">https://www.britannica.com/art/electronic-dance-music</span></a><span style=\"font-weight: 400;\"> </span></p>",
            "author": {
                "name": "Drey Phillips"
            },
            "tags": [
                   "pop culture, music, &amp; lit",
                   "March 2024"
            ],
            "date_published": "2024-03-20T13:29:48-07:00",
            "date_modified": "2024-03-20T13:32:41-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/all-the-cerulean-in-the-world/",
            "url": "https://bayeagle.pages.dev/all-the-cerulean-in-the-world/",
            "title": "All the Cerulean in the World",
            "summary": "As for her Tuesday, her back is tired. She feels calluses on his fingers as he traces her naked spine, but she ignores the pool of oily sweat she soaks up from his generous heart. It, his heart, is the color purple because of indirect&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">As for her Tuesday, her back is tired. She feels calluses on his fingers as he traces her naked spine, but she ignores the pool of oily sweat she soaks up from his generous heart. It, his heart, is the color purple because of indirect injury, her fault, the oil an Indian yellow. They lie together under the staticky eiderdown across from the cooing blues from her monitor. V is for Vendetta, because she burns hours in that cool blue light, and sometimes he wonders if blue is all she sees. It is work, home, dinner, work. No mention of </span><i><span style=\"font-weight: 400;\">The Vendetta</span></i><span style=\"font-weight: 400;\">, the hours she keeps. None from him, because he is a gentleman. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">And because she might break. Her doctor calls her Glass. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Through sobs each night she sticks the pills in her mouth, his insistence, and he strokes her throat to wish them well. Sometimes they work, and off she jogs to critique calligraphy in the clouds. Sometimes they make life worse, and then the cheesy needles in the alley behind that LA motel beckon with ballads of “Buy Me\" and “I Told You So”. Here she withers under the whispers, the demand to refuse the easy walk to haven and its grand appeal.</span><span style=\"font-weight: 400;\"> </span><i><span style=\"font-weight: 400;\">Sedatives</span></i><span style=\"font-weight: 400;\">, sings that LA alley, </span><i><span style=\"font-weight: 400;\">buy me, try me, didn’t I tell you? </span></i><span style=\"font-weight: 400;\">But here too is the gentleman to soothe her, tighten the orchid stitches in her brain, there because of injury. Here he is to trace her body that smells of jasmine and chamomile, to remind her of the word </span><i><span style=\"font-weight: 400;\">morality</span></i><span style=\"font-weight: 400;\">.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Some days she forgets her name, and some nights her pupils melt into the blues until the afternoons bring her all the cerulean in the world. But under the pale linen, locked around her waist, he knows she will sleep tonight.</span></p>",
            "author": {
                "name": "LaVie Saad"
            },
            "tags": [
                   "Original Works",
                   "March 2024"
            ],
            "date_published": "2024-03-20T13:28:16-07:00",
            "date_modified": "2024-03-20T13:28:16-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/psych-experiments/",
            "url": "https://bayeagle.pages.dev/psych-experiments/",
            "title": "Psych Experiments",
            "summary": "In the captivating world of psychology, some experiments stand out as true game-changers, shaking the very foundations of our understanding of human behavior. From the profound to the perplexing, these studies have left an indelible mark on the field, shaping the way we perceive ourselves&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">In the captivating world of psychology, some experiments stand out as true game-changers, shaking the very foundations of our understanding of human behavior. From the profound to the perplexing, these studies have left an indelible mark on the field, shaping the way we perceive ourselves and others.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Let's take a thrilling journey through some of the most renowned psychology experiments, each one a window into the complexities of the human mind.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Harlow's Studies on Attachment: The Power of Comfort</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">In the 1950s and 1960s, Harry Harlow embarked on a series of groundbreaking experiments with rhesus monkeys. His goal? To unravel the mysteries of attachment and its impact on development. What he discovered revolutionized our understanding of the emotional bonds that tie us together.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Picture this: a baby monkey faced with two \"mothers.\" One was a wire contraption holding a bottle, offering sustenance but devoid of warmth. The other? A soft, cloth mother, lacking food but radiating comfort. To the surprise of many, the infant monkeys overwhelmingly chose the latter. They clung to the cloth mother, seeking solace in its soft embrace, even when hungry.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Harlow's studies shattered the prevailing belief that attachment was solely about fulfilling basic needs like food. Instead, he highlighted the profound importance of contact comfort and social interaction in fostering healthy emotional development. These findings echoed beyond the world of monkeys, resonating with parents and psychologists alike, forever changing how we view the bonds between caregivers and children.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Rosenhan's Study on Being Sane in Insane Places: The Thin Line of Perception</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Fast forward to 1973, when David Rosenhan conducted a study that turned the psychiatric world on its head. His aim? To explore the validity of psychiatric diagnoses and the experiences of those labeled as mentally ill. What he uncovered was both astonishing and deeply troubling.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Rosenhan and his team, dubbed \"pseudopatients,\" feigned auditory hallucinations to gain admission to various psychiatric hospitals. Once inside, they ceased simulating any symptoms and behaved entirely as they would in their everyday lives. The results were staggering. Hospital staff interpreted their normal behaviors through the lens of mental illness, diagnosing them with disorders like schizophrenia.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">This study, known as \"On Being Sane in Insane Places,\" exposed the alarming ease with which individuals can be stigmatized and mislabeled within psychiatric institutions. It raised profound questions about the reliability of psychiatric diagnoses and the blurred line between normality and perceived illness. Rosenhan's work continues to reverberate, urging us to critically examine our assumptions about mental health and the societal constructs that shape them.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Kitty Genovese Case and Bystander Effect: The Power of Social Influence</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">In 1964, the tragic case of Kitty Genovese shocked the nation and spurred research into the bystander effect. Genovese, a young woman, was brutally attacked and murdered outside her apartment building. What made this case particularly haunting was the revelation that numerous witnesses observed the attack from their windows, yet no one intervened or called for help.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">This chilling phenomenon sparked a wave of inquiry into why individuals often fail to assist in emergencies when others are present. The bystander effect, as it came to be known, points to the diffusion of responsibility in group settings. When surrounded by others, individuals may feel less personally accountable to act, assuming someone else will step in.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Kitty Genovese's tragic fate highlighted not only the bystander effect but also the powerful sway of social influence on our behavior. It serves as a stark reminder of the complexities of human nature and the subtle yet significant ways in which our actions are shaped by the presence of others.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">From the warmth of Harlow's cloth mothers to the unsettling revelations of Rosenhan's pseudopatients and the sobering lessons of Kitty Genovese, these psychology experiments form a rich tapestry of human behavior. They remind us of our capacity for compassion and connection, as well as the sobering truths of social influence and perception.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">As we delve deeper into the intricate workings of the human mind, these studies serve as beacons, guiding our quest for understanding. They challenge us to question assumptions, rethink established norms, and navigate the complex interplay of biology, environment, and society that shapes who we are.</span></p>\n<p>co-authored by Tyler Kazen</p>",
            "author": {
                "name": "Haydn Song"
            },
            "tags": [
                   "Science",
                   "March 2024"
            ],
            "date_published": "2024-03-20T13:17:42-07:00",
            "date_modified": "2024-03-20T13:28:35-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/saturn-and-spoked-rings/",
            "url": "https://bayeagle.pages.dev/saturn-and-spoked-rings/",
            "title": "Saturn and Spoked Rings",
            "summary": "Saturn is the sixth planet from the sun and the second largest planet in the solar system. This large plant is very unique in the solar system as its chemical makeup is mostly composed of hydrogen and helium. Though this is similar to Jupiter, a&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Saturn is the sixth planet from the sun and the second largest planet in the solar system. This large plant is very unique in the solar system as its chemical makeup is mostly composed of hydrogen and helium. Though this is similar to Jupiter, a fellow gas giant, Saturn is also known for its rings. </span></p>\n<p><span style=\"font-weight: 400;\">Galileo discovered that Saturn was different from other planets in our solar system in that it had a “ring plane crossing” while other planets did not. At the time the properties of the rings were unknown, there was much to be discovered. In 1655, Christaan Huygens said that these rings were solid and inclined about Saturn’s body. A few years later, astronomers suggested that these rings were composed of multiple satellites. These are natural satellites, such as space dust, meteorites, debris, and other masses in space. Though this theory was confirmed approximately 200 years later, we still have much to discover about Saturn’s rings. </span></p>\n<p><span style=\"font-weight: 400;\">Researchers have studied Saturn's rings from what they are made of to how fast they travel. Recently, there has been a discovery explored by a photo by NASA’s Hubble Space Telescope in October 2023. It was discovered that Saturn’s rings behave in a phenomenon called ring spokes.  These so-called “spokes” are described as “transient features that rotate along the rings,” according to NASA. When these spokes are active, or visually seen, additional spokes are then created and continue adding to the pattern. Though these do continue to form and grow, the spokes only last two or three rotations around Saturn.  This phenomenon was first discovered in 1981 when NASA’s Voyager 2 first took photos of ring spokes. Later on, Cassini, another NASA orbiter, saw these spokes throughout its mission that ended in 2017. It had been theorized that gravitational fields and other factors may have caused this, but new information was brought to light when Hubble was able to capture the evidence.</span></p>\n<p><span style=\"font-weight: 400;\">Hubble is equipped with Hubble’s Outer Planets Atmospheres Legacy, also known as OPAL, which is a program that monitors weather on all four gas-giant planets. This program has been in place for nearly a decade and continues to provide researchers with important data when researching these larger planets. In studying OPAL imaging, scientists have found that the number and type of spokes differ throughout Saturn’s seasons. Saturn experiences different seasons that each last approximately seven years. Since Saturn is on a tilted axis (approximately 27º), similar to Earth (approximately 23º), these seasons are more pronounced.  As research takes scientists closer to Saturn’s equinox, NASA found that “these ephemeral structures appear on both sides of the planet simultaneously as they spin around.” Though these spokes can stretch to be larger than Earth’s diameter, these appear to be small compared to Saturn’s large structure. Amy Simon of NASA’s Goddard Space Flight Center states, “The leading theory is that spokes are tied to Saturn’s powerful magnetic field, with some sort of solar interaction with the magnetic field that gives you spokes.”</span></p>\n<p><span style=\"font-weight: 400;\">There are many theories as to how this phenomenon is happening. From solar wind to electrostatic forces, Saturn has many exciting properties that will influence the intensity of these spoked rings. </span></p>\n<p> </p>\n<p><br><br></p>\n<p><a href=\"https://science.nasa.gov/saturn\"><span style=\"font-weight: 400;\">https://science.nasa.gov/saturn</span></a></p>\n<p><a href=\"https://www.cnn.com/2023/12/26/world/hubble-saturn-rings-spokes-scn/index.html\"><span style=\"font-weight: 400;\">https://www.cnn.com/2023/12/26/world/hubble-saturn-rings-spokes-scn/index.html</span></a></p>\n<p><a href=\"https://www.space.com/23235-rings-of-saturn.html\"><span style=\"font-weight: 400;\">https://www.space.com/23235-rings-of-saturn.html</span></a></p>\n<p><a href=\"https://www.sciencedaily.com/releases/2023/12/231221162221.htm\"><span style=\"font-weight: 400;\">https://www.sciencedaily.com/releases/2023/12/231221162221.htm</span></a></p>\n<p><br><br></p>",
            "author": {
                "name": "Harper Dame"
            },
            "tags": [
                   "Science",
                   "March 2024"
            ],
            "date_published": "2024-03-20T13:16:08-07:00",
            "date_modified": "2024-03-20T13:16:08-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/accessible-science/",
            "url": "https://bayeagle.pages.dev/accessible-science/",
            "title": "Accessible Science",
            "summary": "Henrietta Lacks died in 1951, but the exploitation of her living cells continues to this day. From COVID-19 vaccinations to the medical community’s foundational knowledge of cancer, Henrietta Lacks’s cell line, widely known as HeLa, revolutionized medical knowledge and research. Her DNA sequence was used&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Henrietta Lacks died in 1951, but the exploitation of her living cells continues to this day. From COVID-19 vaccinations to the medical community’s foundational knowledge of cancer, Henrietta Lacks’s cell line, widely known as HeLa, revolutionized medical knowledge and research. Her DNA sequence was used to save the lives of millions, including those who suffered from the same cervical cancer that Lacks fought against. Despite the myriad medical advancements and strides in cancer research that Henrietta Lacks spurred, questions of medical ethics and consent rise to the forefront of her legacy.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Baltimore’s John Hopkins Hospital took Lacks’s cells without her knowledge or consent, sharing the samples with a researcher. In a cascading domino effect, Henrietta Lacks’s cells spread across the globe and built the foundation for innumerable biotechnical advancements. Pharmaceutical companies made billions off her stolen cells and the advancements owed to her cellular lineage; polio vaccine groundwork, single-cell microscopic imaging, and even cellular research in space owe their medical foundation to the HeLa line. In 2013, researchers published her genome online for the world to see, which reignited the controversy. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Two sides quickly formed in the bioethical and legal debate over Henrietta Lacks’s cells. One argued that the contributions to medicine her cells made outweighed the violations of privacy, consent, and doctor-patient confidentiality. Although the relevant laws did not exist at the time of Henrietta Lacks’s cancer treatment and subsequent tissue sampling, the other side argued that the continued financial gain of medical corporations based on the initial violation was unlawful and immoral. This debate continued in earnest until Thermo Fisher Scientific reached a settlement with Henrietta Lacks’s family in September of 2023, quelling public outcry.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Although the battle against Thermo Fisher Scientific has come to a close, the fight against unethical practices in medicine continues in Henrietta’s name. Her family plans to take on the other pharmaceutical companies associated with her cellular lineage, seeking restitution and ensuring that the medical violations she underwent never occur again. Henrietta Lacks’s case exists at the intersection of ethics and medicine, highlighting the importance of patient confidentiality and honesty from our physicians.</span></p>\n<p><br><br><br></p>\n<p><a href=\"https://www.nature.com/articles/d41586-020-02494-z\"><span style=\"font-weight: 400;\">https://www.nature.com/articles/d41586-020-02494-z</span></a></p>\n<p> </p>\n<p><a href=\"https://apnews.com/article/henrietta-lacks-hela-cells-thermo-fisher-scientific-bfba4a6c10396efa34c9b79a544f0729\"><span style=\"font-weight: 400;\">https://apnews.com/article/henrietta-lacks-hela-cells-thermo-fisher-scientific-bfba4a6c10396efa34c9b79a544f0729</span></a></p>\n<p> </p>\n<p><a href=\"https://osp.od.nih.gov/hela-cells/significant-research-advances-enabled-by-hela-cells/\"><span style=\"font-weight: 400;\">https://osp.od.nih.gov/hela-cells/significant-research-advances-enabled-by-hela-cells/</span></a></p>\n<p> </p>",
            "author": {
                "name": "Julian Raymond"
            },
            "tags": [
                   "Science",
                   "March 2024"
            ],
            "date_published": "2024-03-20T13:12:38-07:00",
            "date_modified": "2024-03-20T13:12:38-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/adapting-to-ai-navigating-the-evolving-workforce/",
            "url": "https://bayeagle.pages.dev/adapting-to-ai-navigating-the-evolving-workforce/",
            "title": "Adapting to AI: Navigating the Evolving Workforce",
            "summary": "The increasing adoption of artificial intelligence indicates that the significance of humans in the global economy is likely to diminish in the coming decades. The idea of “artificial intelligence” dates back thousands of years to ancient times when inventors devised instruments called “automatons” which were&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">The increasing adoption of artificial intelligence indicates that the significance of humans in the global economy is likely to diminish in the coming decades. The idea of “artificial intelligence” dates back thousands of years to ancient times when inventors devised instruments called “automatons” which were mechanical and moved independently of human intervention, laying the groundwork for AI. However, it was not until Alan Turing published his work “Computing Machinery and Intelligence” in 1950, which proposed a test of machine intelligence called “The Imitation Game” that led experts to conduct further research. The term “artificial intelligence” was later coined by John McCarthy in 1955 during the Dartmouth Conference, where the field of AI was officially named and established, leading to its emergence into popular use. While modern technologies may lead to the elimination of certain jobs, they will also give rise to new possibilities for several individuals. Amidst the concerns of job displacement, the transformative impact of modern technologies not only poses challenges but presents new opportunities that create new demand for highly specialized workers and skills. </span></p>\n<p><span style=\"font-weight: 400;\">Notably, the recent growth and advancements in innovative technology are marked by an improved quality of work that grants humans more tactical, worthwhile, and emotionally satisfying tasks. For the United States, Germany, and Australia, the growth in labor supply does not consistently align with the changes in demand. This remains true for computer-related occupations and jobs in science, technology, and engineering that fuel the automation of all industries. According to the Boston Consulting Group, the estimated US talent shortfall in computer and mathematics is estimated to be at 6.1 million jobs by 2030 (Strack, Rainer, et al.). Similarly, occupations that entail minimal automation but rely on compassionate human interaction, such as healthcare, social services, and certain teaching roles, will also witness a surge in demand for human skills. Given Germany and the United State’s general human deficit, they are each expected to face the greatest pressure for talent in these occupations. For instance, Germany is estimated to suffer a shortfall of 346,000 people in the educational and library sector while their deficit for healthcare practitioners and technical support will rise to 254,000 (BCG). In contrast to Germany and the United States, Australia is expected to experience substantial growth in labor supply following the country’s 2002 offer of cash subsidies to parents of newborns, which directly resulted in a baby boom. These individuals are anticipated to enter the job market over the next decade and contribute to the growing demand for labor. Although the usage of technology remains consistent across all three countries, their varying demographic profiles highlight their nation’s foreseen challenges and the need for a workforce that meets the needs of the digital age. </span></p>\n<p><span style=\"font-weight: 400;\">The evolving landscape of artificial intelligence is poised to reshape the global workforce, presenting both challenges and opportunities for individuals and nations. As the modern world traverses the increasing adoption of AI, it is evident that the historical progression from ancient automations to Alan Turing's groundbreaking work has paved the way for the contemporary era of artificial intelligence. While concerns about job displacement persist, the transformative impact of modern technologies introduces a paradigm shift, creating new possibilities and demand for highly specialized skills.</span></p>\n<p><br><br><br></p>\n<h1><span style=\"font-weight: 400;\">Works Cited</span></h1>\n<p><span style=\"font-weight: 400;\">Farrukh, Bisma. “The Truth about Technology Creating More Jobs than It Destroys.” </span><i><span style=\"font-weight: 400;\">Medium</span></i><span style=\"font-weight: 400;\">, 21 May 2023, medium.com/@pencihub/the-truth-about-technology-creating-more-jobs-than-it-destroys-534e00fa32c0. Accessed 19 Feb. 2024.</span></p>\n<p><span style=\"font-weight: 400;\">Strack, Rainer, et al. </span><i><span style=\"font-weight: 400;\">The Future of Jobs in the Era of AI</span></i><span style=\"font-weight: 400;\">. 2021.</span></p>\n<p><span style=\"font-weight: 400;\">Turing, Alan. “Computing Machinery and Intelligence.” </span><i><span style=\"font-weight: 400;\">Mind</span></i><span style=\"font-weight: 400;\">, vol. LIX, no. 236, 1 Oct. 1950, pp. 433–460, https://doi.org/10.1093/mind/lix.236.433.</span></p>\n<p><span style=\"font-weight: 400;\">“What Is the History of Artificial Intelligence (AI)?” </span><i><span style=\"font-weight: 400;\">Tableau</span></i><span style=\"font-weight: 400;\">, www.tableau.com/data-insights/ai/history#definition. Accessed 19 Feb. 2024.</span></p>\n<p> </p>",
            "author": {
                "name": "Estefani Cruz"
            },
            "tags": [
                   "World Events",
                   "March 2024"
            ],
            "date_published": "2024-03-20T13:07:21-07:00",
            "date_modified": "2024-03-20T13:07:21-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/behind-the-barrels-el-segundos-buried-backstory/",
            "url": "https://bayeagle.pages.dev/behind-the-barrels-el-segundos-buried-backstory/",
            "title": "Behind the Barrels: El Segundo&#x27;s Buried Backstory",
            "summary": "In 1911, The El Segundo Standard Oil refinery was opened, El Segundo is easily recognized as the Spanish phrase for “the second”, referring to Standard Oil’s refineries, but the details behind the creation of the city are still largely unknown. The truth is murky, and&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">In 1911, The El Segundo Standard Oil refinery was opened, El Segundo is easily recognized as the Spanish phrase for “the second”, referring to Standard Oil’s refineries, but the details behind the creation of the city are still largely unknown. The truth is murky, and involves poorly documented deals and the rise of the richest person in the country’s history. This is part of the story of the beginnings of our city.</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Contrary to what some may say, the “second'' that El Segundo represents does not refer to the second Standard Oil refinery at all, but instead the second refinery created by Standard in California, sparked when J.D. Rockefeller’s Standard purchased D.G. Scofield’s Pacific Coast Oil (PCO) for $761,000 in 1879, (LaHerald) `but the development of Pacific Coast may have been ground to a half had it not been saved by Rockefeller. The expansion of oil enterprises in Los Angeles had gotten quite rapid by this point, (notably, in the 1860s, Shell and Exxon started their first plants in the Ventura basin) Shell and Exxon were eager to move to Los Angeles when our oil field was found by E.L. Doheney in 1892. [</span><a href=\"https://www.enopetroleum.com/californiaoilboom.html\"><span style=\"font-weight: 400;\">eno petroleum corporation</span></a><span style=\"font-weight: 400;\">] </span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">The purchase by Standard may have saved PCO, but the powerhouse it created ended up causing an imbalance in the scene towards Standard's side (PCO had since been renamed to Standard Oil Co. (California)), and \"in May 1911, Standard Oil (California) was separated from its parent Standard Oil and became an independent entity after the federal government won an antitrust lawsuit.\" (</span><a href=\"https://scvhistory.com/scvhistory/sw_laherald121100.htm\"><span style=\"font-weight: 400;\">LaHerald</span></a><span style=\"font-weight: 400;\">) Under the new Standard (CA) label, Scofield seeked to create a new refinery, and R.J. Hanna from Pennsylvania was put in control of finding a suitable location, with \"a ready supply of water, and access to a harbor for shipping\"(</span><a href=\"https://blogs.dailybreeze.com/history/2009/05/06/el-primero-el-segundo-and-standard-oil/\"><span style=\"font-weight: 400;\">Daily Breeze</span></a><span style=\"font-weight: 400;\">).</span></p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">Hanna found a far, owned by Frank Bennett(the land owned by George Peck), a melon and lima bean farm, and purchased it in June 1911, when his wife decided to name it \"El Segundo\", referring to the venture in oil that had led them to the unincorporated area, and was officially incorporated as a city in 1917. A single decade was all it took for the second large venture of El Segundo to take place, in the purchase and development of Los Angeles Municipal Airport, that would later become Los Angeles International; the industrialization and development of the city was spurred quite rapidly, but there’s still more to the story, make sure to read the next edition to see how Bennett and Peck even got to the city.</span></p>",
            "author": {
                "name": "Vicken Semerdjian"
            },
            "tags": [
                   "March 2024",
                   "History"
            ],
            "date_published": "2024-03-20T13:03:09-07:00",
            "date_modified": "2024-03-20T13:03:09-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/boys-soccer-team-shoutout/",
            "url": "https://bayeagle.pages.dev/boys-soccer-team-shoutout/",
            "title": "Boys Soccer Team Shoutout",
            "summary": "Shoutout to our amazing El Segundo Boys Soccer team for making it to CIF this year! We had the opportunity to interview one of the senior team captains, Liam Moore. We first asked him what some of this season’s highlights were, to which he replied,&hellip;",
            "content_html": "<p> </p>\n<p><span style=\"font-weight: 400;\">Shoutout to our amazing El Segundo Boys Soccer team for making it to CIF this year! We had the opportunity to interview one of the senior team captains, Liam Moore. We first asked him what some of this season’s highlights were, to which he replied, “Scoring in the 90th minute to force overtime against North Torrance and then beating them in overtime. Scoring a 90th minute goal against West to win the game. Beating Torrance 5-0.”</span></p>\n<p><strong> </strong></p>\n<p><span style=\"font-weight: 400;\">We also asked how this season went for the team overall. Moore said, “This season went extremely well for us. We were 10-1-1 in the league, which is the best record in the last four years for El Segundo. We did fall short of our expectations in CIF though, losing in the second round.” Moore also states that, “The future seasons will go incredibly well. Half of our starting team right now is freshmen and sophomores and our JV team went undefeated this year. Next year’s varsity team is going to be one of the best ever.”</span></p>\n<p><strong> </strong></p>\n<p><span style=\"font-weight: 400;\">What Moore has loved about playing for the high school’s team is, “scoring and assisting goals with my brother and teammates. I love how competitive it gets.” For anyone interested in joining soccer, you “absolutely have to try it. It is the most fun sport they will ever play and they’ll be hooked from the moment they start playing.”</span></p>\n<p><strong> </strong></p>\n<p><span style=\"font-weight: 400;\">Liam Moore’s message to the school is, “Thank you to the coaches Andrew and Alan Kelley, Gil, and Scott.” Follow ESHS Boys Soccer team on social media to stay updated during future seasons! (@eshs_boyssoccer)</span></p>",
            "author": {
                "name": "Anna Harper"
            },
            "tags": [
                   "Sports",
                   "March 2024"
            ],
            "date_published": "2024-03-20T12:57:50-07:00",
            "date_modified": "2024-03-20T12:57:50-07:00"
        },
        {
            "id": "https://bayeagle.pages.dev/literature-form-the-past-to-the-present/",
            "url": "https://bayeagle.pages.dev/literature-form-the-past-to-the-present/",
            "title": "Literature from the Past to the Present",
            "summary": "Fictional literature has always been important to society. It provides us with a way to spread culture, a way to express emotions, and of course, a source of entertainment. However, literature has evolved immensely over the centuries. In comparison to works of older eras, today’s&hellip;",
            "content_html": "<div id=\"contentsContainer\" class=\"style-scope qowt-page\">\n<div id=\"contents\" class=\"style-scope qowt-page\">\n<p id=\"E134\" class=\"x-scope qowt-word-para-0\"><span id=\"E135\">Fictional literature has always been important to society. It provides us with a way to spread culture, a way to express emotions, and of course, a source of entertainment. However, literature has evolved immensely over the centuries. In comparison to works of older eras, today’s literature is quite different due to drastic shifts in societal standards, ideas, living conditions, and morals. These shifts have altered both the content and characters found in important works, since current beliefs heavily influence the popular media of their specific time period. </span></p>\n<p id=\"E136\" class=\"x-scope qowt-word-para-0\"><span id=\"E137\"> </span></p>\n<p id=\"E138\" class=\"x-scope qowt-word-para-0\"><span id=\"E139\">We can track this evolution through what are considered some of the best novels of the 19th to the 21st centuries. A comparison between popular novels of these two time periods serves to display the evolution of literature from the past to the present through historical development. The 19th century is divided into two literary periods, which are the Romantic and Victorian periods. The Romantic period lasted from roughly 1798 to 1837. Literature of this era was fascinated with the beautiful and the grotesque, and was also heavily influenced by political events, such as the French Revolution (Source 1). The French Revolution was a rebellion against the French monarchy that was full of passion, anger, and was driven by a demand for change (specifically for a demand related to an elimination of tyranny). Romantics were also especially interested in human emotion and a sense of excitement related to the natural world and an artists’ creativity. In addition to this, the Romantic period was preceded by the Age of Reason, also known as the Enlightenment, which began in the late 17th century and ended in the early 19th century. During the Enlightenment a new wave of knowledge had recently spread around Europe, and ideas related to rationalism and progressivism were considered to be new ways of thinking at the time (Source 3). New principles, such as the ideas above, are often incorporated into the media of their time period, and so popular literature usually reflects the ideas of the time period it was written in.</span></p>\n<p id=\"E140\" class=\"x-scope qowt-word-para-0\"><span id=\"E141\"> </span></p>\n<p id=\"E142\" class=\"x-scope qowt-word-para-0\"><span id=\"E143\">One example of this concept can be observed in Mary Shelley’s </span><span id=\"E144\">Frankenstein</span><span id=\"E145\">. In this novel, Victor Frankenstein, a young and passionate scientist who is curious about the principles of life, crafts a creation out of various dead body parts and brings it to life. Victor’s creation is hideous, but it has the capacity to think as well as any human can. As soon as he completes his experiment, however, Victor finds himself disgusted with what he has made. The reader learns that the creation only wants love, but understands that it will never be loved because of the way it looks. Out of spite and frustration, the creation kills Victor’s brother and the rest of his family over the course of the novel. While the creation is painted as a monster, Shelley masterfully crafts her characters so that it is impossible to decide who really is the villain: a creation who kills out of frustration, or a creator who is cruel and refuses to give his creation love. This relates to the Romantic period and its principles: a fascination with beauty and ugliness. Victor’s initial obsession with nature and the fundamentals of life are also related to common themes of interest of this era (Source 4). Finally, Shelley’s novel can be somewhat linked to current world events of the century, since a variety of </span></p>\n</div>\n</div>\n<div id=\"pageBorders\" class=\"style-scope qowt-page\" ></div>\n<div id=\"contentsContainer\" class=\"style-scope qowt-page\">\n<div id=\"contents\" class=\"style-scope qowt-page\">\n<p class=\"x-scope qowt-word-para-0 x-scope qowt-word-para-0\">rebellions emerged during the 19th century and the novel essentially describes a rebellion against one’s creator.</p>\n<p id=\"E146\" class=\"x-scope qowt-word-para-0\"><span id=\"E147\"> </span></p>\n<p id=\"E148\" class=\"x-scope qowt-word-para-0\"><span id=\"E149\">The Romantic period lasted until the mid-19th century, and its conclusion marked the beginning of the Vicotrian era of literature. This period of time correlates with Queen Victoria’s rule of England. During this time, industrialism flourished and was a competitive new market, and many countries were transitioning from agricultural societies into rapidly expanding industrial powerhouses. Additionally, ideas from the Age of Reason, such as equality for all and individualism, grew increasingly popular. According to Eastern Connecticut University, a major difference between Victorian and Romantic literature is that during the Victorian era, the steam printing press was developed and helped make the production of texts far cheaper than before. Because of this, all civilians could access literature, and authors had a wider audience to appeal to.</span></p>\n<p id=\"E150\" class=\"x-scope qowt-word-para-0\"><span id=\"E151\"> </span></p>\n<p id=\"E152\" class=\"x-scope qowt-word-para-1\"><span id=\"E153\">An example of this concept is </span><span id=\"E154\">A Chirstmas Carol</span><span id=\"E155\"> written by Charles Dickens. This novel depicts the life of Ebenezer Scrooge, an old man who despises the idea of Christmas and happiness. During the novel, Scrooge is visited by ghosts of Christmas past, present, and future, and each of these presences provides Scrooge with a new perspective. Suddenly, after numerous strange encounters with these ghosts he returns to his bed safely, and decides to take advantage of a new opportunity to redeem himself by finally allowing himself to participate in Chrirstmas festivities (Source 6). An increase in book production due to mass-market steam printing allowed lower classes to afford books. Because of this, Victorian authors were encouraged to include a more diverse array of socio-economic classes in their stories to appeal to a bigger pool of readers. Dickens’ work focuses on the lower class, since many of the supporting characters in the story live in poverty. Because the steam printing press increased access to literature, this novel reflected the new norms of the era.</span></p>\n<p id=\"E157\" class=\"x-scope qowt-word-para-0\"><span id=\"E158\"> </span></p>\n<p id=\"E159\" class=\"x-scope qowt-word-para-0\"><span id=\"E160\">While </span><span id=\"E161\">Frankenstien</span><span id=\"E162\"> and </span><span id=\"E163\">A Chirstmas Carol</span><span id=\"E164\"> clearly reflect the societal norms of their</span></p>\n<p id=\"E165\" class=\"x-scope qowt-word-para-0\"><span id=\"E166\">respective eras, contemporary literature clearly represents the values of the 21st century as well. For instance, </span><span id=\"E167\">The Hunger Games</span><span id=\"E168\"> is a trilogy written by Susan Collins that was inspired by a war in Iraq as well as the Roman gladiators (Source 7). In the first book of this series, Collins describes protagonist Katniss Everdeen, as a girl who lives in a dystopian world with her sister and mother. Katniss lives in a world divided into twelve districts, and every year two children from each district are selected to participate in the Hunger Games (a fight to the death). Katniss volunteers when her sister Primrose is selected as a tribute. Peeta Mellark, a boy from Katniss’s district is also selected as a tribute, and the reader watches a romantic relationship surrounded by tragedy unfold between Katniss and Peeta. Betrayals and sacrifices often occur in this novel, which truly demonstrate the selfishness of mankind and human instinct to physically fight when forced to. This novel is also fictional in almost every aspect, which is another reason this book is reflective of the Contemporary literary era (as experimentalism and creativity are clearly utilized throughout Collins’s work). Additionally, </span><span id=\"E169\">The Hunger Games</span><span id=\"E170\"> was inspired by the Vietnam and Iraq war, two recent political events that certainly influenced the plot of the series. </span></p>\n<p id=\"E171\" class=\"x-scope qowt-word-para-0\"><span id=\"E172\"> </span></p>\n</div>\n</div>\n<div id=\"pageBorders\" class=\"style-scope qowt-page\" ></div>\n<div id=\"contentsContainer\" class=\"style-scope qowt-page\">\n<div id=\"contents\" class=\"style-scope qowt-page\">\n<p id=\"E173\" class=\"x-scope qowt-word-para-0 x-scope qowt-word-para-0\"><span id=\"E174\">As demonstrated, the evolution of literature clearly reflects the evolution of societal values The societal norms of the Romantic, Victorian, and current literary periods are displayed evidently throughout novels written during each era’s specific time frame. As time continues onward, literature will continue to change as the values of society are altered and changed.</span></p>\n<p id=\"E175\" class=\"x-scope qowt-word-para-0\"><span id=\"E176\"> </span></p>\n<p id=\"E177\" class=\"x-scope qowt-word-para-0\"><span id=\"E178\">Works Cited (Unformatted)</span></p>\n<p id=\"E179\" class=\"x-scope qowt-word-para-0\"><span id=\"E180\">1. https://www.easternct.edu/speichera/understanding-literary-history-all/the-romantic-</span></p>\n<p id=\"E181\" class=\"x-scope qowt-word-para-0\"><span id=\"E182\">period.html</span></p>\n<p id=\"E183\" class=\"x-scope qowt-word-para-0\"><span id=\"E184\">2. https://www.bl.uk/romantics-and-victorians/articles/the-romantics</span></p>\n<p id=\"E185\" class=\"x-scope qowt-word-para-0\"><span id=\"E186\">3. https://www.khanacademy.org/humanities/us-history/colonial-america/colonial-north-</span></p>\n<p id=\"E187\" class=\"x-scope qowt-word-para-0\"><span id=\"E188\">america/a/the-enlightenment</span></p>\n<p id=\"E189\" class=\"x-scope qowt-word-para-0\"><span id=\"E190\">4. https://www.sparknotes.com/lit/frankenstein/context/literary/mary-shelley-and-</span></p>\n<p id=\"E191\" class=\"x-scope qowt-word-para-0\"><span id=\"E192\">romanticism/</span></p>\n<p id=\"E193\" class=\"x-scope qowt-word-para-0\"><span id=\"E194\">5. https://www.easternct.edu/speichera/understanding-literary-history-all/the-victorian-</span></p>\n<p id=\"E195\" class=\"x-scope qowt-word-para-0\"><span id=\"E196\">period.html#:~:text=The%20Victorian%20period%20of%20literature,into%20an%20urban%</span></p>\n<p id=\"E197\" class=\"x-scope qowt-word-para-0\"><span id=\"E198\">2C%20industrial%20one.</span></p>\n<p id=\"E199\" class=\"x-scope qowt-word-para-0\"><span id=\"E200\">6. https://www.sparknotes.com/lit/christmascarol/summary/</span></p>\n<p id=\"E201\" class=\"x-scope qowt-word-para-0\"><span id=\"E202\">7. https://www.caldwellschools.com/cms/lib/NC01811136/Centricity/Domain/261/The_Hung</span></p>\n<p id=\"E203\" class=\"x-scope qowt-word-para-0\"><span id=\"E204\">er_Games_and_Mythology.docx#:~:text=Author%20Suzanne%20Collins%20has%20sai</span></p>\n<p id=\"E205\" class=\"x-scope qowt-word-para-0\"><span id=\"E206\">d,footage%20of%20the%20Iraq%20War.</span></p>\n<p id=\"E207\" class=\"x-scope qowt-word-para-0\"><span id=\"E208\">8. https://www.masterclass.com › articles › modernist-literat…</span></p>\n<p id=\"E209\" class=\"x-scope qowt-word-para-0\"></p>\n</div>\n</div>",
            "author": {
                "name": "LaVie Saad"
            },
            "tags": [
                   "Original Works",
                   "History",
                   "December 2023"
            ],
            "date_published": "2023-12-26T16:37:16-08:00",
            "date_modified": "2023-12-26T16:38:28-08:00"
        }
    ]
}
