{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Bay Eagle",
    "description": "",
    "home_page_url": "https://bayeagle.pages.dev",
    "feed_url": "https://bayeagle.pages.dev/feed.json",
    "user_comment": "",
    "icon": "https://bayeagle.pages.dev/media/website/logo.png",
    "author": {
        "name": "Bay Eagle Editors"
    },
    "items": [
        {
            "id": "https://bayeagle.pages.dev/marine-heat-waves-cause-loss-in-biodiversity/",
            "url": "https://bayeagle.pages.dev/marine-heat-waves-cause-loss-in-biodiversity/",
            "title": "Marine Heat Waves Cause Loss in Biodiversity",
            "summary": "By: Harper Dame Due to the changes in environmental behaviors, there has been a great loss in biodiversity throughout the oceans. Through studies conducted by Professor Fred Wells, from Curtin’s School of Molecular and Life Sciences, Wells claimed that there was a “catastrophic decline” in&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/0c3b9a_499d43868e9b4b8da57cd580d1d250b8~mv2.jpg/v1/fill/w_925,h_618,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/0c3b9a_499d43868e9b4b8da57cd580d1d250b8~mv2.jpg\" data-is-external-image=\"true\"></p>\n<p id=\"viewer-1dfpl\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: Harper Dame</span></p>\n<p id=\"viewer-93tpk\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Due to the changes in environmental behaviors, there has been a great loss in biodiversity throughout the oceans. Through studies conducted by Professor Fred Wells, from Curtin’s School of Molecular and Life Sciences, Wells claimed that there was a “catastrophic decline” in marine biodiversity (Wells, Marine heatwaves decimate sea urchins, molluscs and more at Rottnest). From 2007 to 2021, there has been documented evidence of this decline in wildlife in Radar Reef and Cape Valmigh at Rottnest Island. Since both of these areas were exposed to the warm Leeuwin Current, the animals were placed in contact with increased temperatures. Other reefs, such as those located in the metropolitan area, were not exposed to warmer currents and still maintained sufficient wildlife. </span></p>\n<p id=\"viewer-bc4rg\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Marine heat waves are commonly the cause for the decline in wildlife populations in the oceans. These heat waves exist in periods of abnormally high temperatures relative to the average temperature of the current season. These waves can be brought to a specific area or through larger currents that travel through the oceans. These are known to cause a change in biodiversity dynamics throughout the ocean. Though only small creatures were greatly impacted on the Rottnest Island, this not only impacts their population but the life cycle and food chain within the area. </span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Studies have shown that there has been a greater number of marine heatwaves between the years of 1981 and 2017. Furthermore, approximately 27 major heat waves were recorded and lasted approximately a month. Some of these heat waves even reached temperatures greater than 5.5 degrees above the average sea temperature. Though this may seem like a “tropical climate” or nice for a “beach day”, these heat waves can actually be detrimental to the wildlife in the ocean. Some may not even be able to adapt to these changes fast enough and become extinct. </span></p>\n<p id=\"viewer-5rl0v\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Without a good course of action, our marine ecosystems may not be present for much longer. Since humans have a huge influence on the frequency of these heat waves, they may become more frequent if we do not understand their causes. Due to our carbon emissions and disregard for what goes into the ocean, these heat waves become more consistent. In fact, these are 20 times more consistent due to human interaction. </span></p>\n<div data-hook=\"rcv-block12\"> </div>\n<p id=\"viewer-5vfqm\" class=\"xVISr Y9Dpf bCMSCT OZy-3 cDpYU ok2w4y bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sources:</span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 cDpYU ok2w4y bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Curtin University. \"Marine heatwaves decimate sea urchins, molluscs and more at Rottnest.\" ScienceDaily. ScienceDaily, 24 February 2023. &lt;<a data-hook=\"linkViewer\" href=\"http://www.sciencedaily.com/releases/2023/02/230224134808.htm\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">www.sciencedaily.com/releases/2023/02/230224134808.htm</u></a>&gt;.</span></p>\n<p id=\"viewer-3pirg\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">University of Bern. \"Marine heatwaves are human-made.\" ScienceDaily. ScienceDaily, 25 September 2020. &lt;<a data-hook=\"linkViewer\" href=\"http://www.sciencedaily.com/releases/2020/09/200925113351.htm\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">www.sciencedaily.com/releases/2020/09/200925113351.htm</u></a>&gt;.</span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Science by The Bay with Harper"
            ],
            "date_published": "2023-12-05T22:22:44-08:00",
            "date_modified": "2023-12-05T22:22:44-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/opinion-shacarri-richardson-and-american-airlines/",
            "url": "https://bayeagle.pages.dev/opinion-shacarri-richardson-and-american-airlines/",
            "title": "Opinion: Sha’Carri Richardson and American Airlines",
            "summary": "By: LaVie Saad Sha’Carri Richardson, star professional track and field athlete was allegedly forced off of an American Airlines flight after she refused to hang up a phone call. She claimed that a twenty-two year old flight attendant asked her to leave a call after&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/0c3b9a_493d7be4f0a44e7388f9a9bce5b5dd04~mv2.jpg/v1/fill/w_925,h_561,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/0c3b9a_493d7be4f0a44e7388f9a9bce5b5dd04~mv2.jpg\" data-is-external-image=\"true\"></p>\n<p id=\"viewer-2sdil\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: LaVie Saad</span></p>\n<p id=\"viewer-2am1b\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sha’Carri Richardson, star professional track and field athlete was allegedly forced off of an American Airlines flight after she refused to hang up a phone call. She claimed that a twenty-two year old flight attendant asked her to leave a call after she boarded the aircraft. Though she did hang up as she was told, she told the attendant she did not like his tone and that he should be more respectful. He then proceeded to ask her to show him proof that her phone was on airplane mode and continued to hover, as she describes, over her phone. After she began to record “herself”, the flight attendant backed away (since he was caught in the video as well). He told her she was not allowed to record, to which she replied she believed she felt harassed. Plenty of passengers jumped into the situation, and some even told Richardson she needed to stop. She quickly became defensive and told other passengers that they should not be involved in her business.</span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">I am slightly conflicted about whether or not to support Richardson, since the article paints her as a difficult passenger who is unwilling to follow the rules of the aircraft. This article is from CNN, but it surprisingly does not provide background information or prior context. CNN is known for its reliability (despite its tendency to typically present liberal opinion), which is why I am inclined to trust the article. However, it is important to check both sides (which is why I am curious about what Richardson posted on her Instagram). If I were to only consider the context that we are given in the article, I would say it was reasonable of the flight attendant to ask her to leave her phone call. Knowing that phones that are not on airplane mode before takeoff may interfere with radio and navigation instruments (which can be detrimental and highly dangerous). However, the flight attendant removed her from the plane (which I believe is a mild overreaction, since her phone should have simply been confiscated). </span></p>\n<p id=\"viewer-atqf6\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Another issue I see is Richardson’s career. Since she is a major athlete, any “scandal” that comes her way may damage her career quite a bit. I personally do not believe it is fair when athletes, actors, or even successful businessmen are heavily impacted by insignificant events. However, an issue such as this may be noteworthy to remember. Once again, I believe it all depends on the context. </span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "World Events"
            ],
            "date_published": "2023-12-05T22:21:09-08:00",
            "date_modified": "2023-12-05T22:21:09-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/staff-spotlight-or-marcos-bolanos/",
            "url": "https://bayeagle.pages.dev/staff-spotlight-or-marcos-bolanos/",
            "title": "Staff Spotlight | Marcos Bolanos",
            "summary": "By: Vicken Semerdjian Marcos Bolanos is a teacher and coach at El Segundo High, teaching Economics, and coaching both Cross Country and the Distance Track team. He recently led both the male and female cross country teams to CIF in 2022, and during his time&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/7705ac_663ba3e8913a4de893cf808253d2011b~mv2.jpeg\" data-is-external-image=\"true\"></p>\n<p id=\"viewer-5f78u\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: Vicken Semerdjian</span></p>\n<p id=\"viewer-cses6\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Marcos Bolanos is a teacher and coach at El Segundo High, teaching Economics, and coaching both Cross Country and the Distance Track team. He recently led both the male and female cross country teams to CIF in 2022, and during his time coaching, a team has made it to CIF-SS finals 9 years, and a team or individual from ESHS has gone to CIF state for 8 years. I have had the pleasure of being an athlete under Coach \"B\" for 2 seasons of cross country, and we (the cross country team) think he is a great role model and coach, and has inspired us to go above and beyond in both running and academics.</span></p>\n<p id=\"viewer-11ere\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q: What is the most rewarding part of coaching a high school sport?</strong></span><span class=\"B2EFF public-DraftStyleDefault-ltr\">A: The most rewarding part would be seeing kids grow and mature on a lot of different levels, individually becoming more mature and accountable to a team, understanding how to follow directions, taking on leadership opportunities, and then also doing things they thought they never could. </span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A lot of the student-athletes that I get maybe never did a lot of/were successful in sports, and so running offers them an opportunity to practice and get better every day, and it's awesome trying to help them set goals that at one point they don't think they could ever do; and when they break them, just seeing that huge smile on their face, it's a remarkable feeling.</span></p>\n<p id=\"viewer-qloh\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q:How has Covid reshaped the way you teach and coach in the 2022-23 school year?</strong></span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A: I think the big mindset change that I've seen happen out of Covid is that more people want to keep things fun/casual, and so I'm having to ease up on how much I enforce certain rules and just try to keep perspective of trying to make running fun and making this sport enjoyable, as something that they want to do as a way to relieve stress and get their minds off stuff. </span></p>\n<p id=\"viewer-3b2b1\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Whereas before it was hyper-competitive, and we wanted to make sure that our team was one of the best in the state, which I still do, but the emphasis now is more on trying to enforce personal growth.</span></p>\n<p id=\"viewer-4mej1\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q:What are some of the similarities and differences between coaching and teaching?</strong></span></p>\n<div data-hook=\"rcv-block20\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">A: Some of the similarities are that typically the people you're coaching want to be there, so it allows you to have some more fun, do different things with them, and learn more about the kids. With teaching sometimes, you have to be mindful of the fact that sometimes the kids don't even want to be in your class because they don't like the subject, or something different.</span></div>\n<div data-hook=\"rcv-block20\"> </div>\n<div data-hook=\"rcv-block20\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">In that way they're different, the way that they're similar is that you still want to encourage kids to make good decisions, to work their hardest to be their best, to participate, and to always put their best foot forward.</span></div>\n<p id=\"viewer-7mua4\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q: What are the similarities that a student and an athlete have to have? And would you recommend sports to someone who is mainly focused on academics?</strong></span></p>\n<p id=\"viewer-6n9ri\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A: Similarities that a student and athlete have to have would be a good work ethic, and commitment to try, and by that I mean it's okay to fail; so in running 80% of the time we don't hit PRs(Personal Records), so you're working, then you have to restructure, and go back to the drawing board- Injuries pop up- you'll overcome adversity, and that's no different from what you have to do in the classroom. A lot of the kids that run take hard math classes, and I would doubt that any of the kids get every math problem right the first time; it takes time, you have to keep putting in the work, and the effort, and I think those are the similarities they share.</span></p>\n<p id=\"viewer-d9t99\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">I would 100% say that every student should participate in some type of sport. I think that we've missed the mark by not mandating it; I think every kid should be involved in some type of team sport, to teach them how to be cooperative, take direction, learn in a different way, how to be coached, because I think that the things that you learn in sport are probably more applicable to real life than some of the stuff that we learn in the classroom.</span></p>\n<p id=\"viewer-f3sah\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q: Any words of encouragement to students coming into the second semester?</strong></span></p>\n<div data-hook=\"rcv-block30\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">A: Do your best. Always keep trying. Don't look at failure as the final line, look at failure as a launching point. A lot of students are hesitant to try because they're worried about failing, but failure is the stepping stone to everything successful.</span></div>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Staff Spotlight"
            ],
            "date_published": "2023-12-05T22:19:04-08:00",
            "date_modified": "2023-12-05T22:19:14-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/winter-fashion-in-southern-california-hibernation-uniforms-on-the-naughty-list/",
            "url": "https://bayeagle.pages.dev/winter-fashion-in-southern-california-hibernation-uniforms-on-the-naughty-list/",
            "title": "Winter Fashion in Southern California - Hibernation Uniforms on the Naughty List",
            "summary": "By: Katy Durand Fall is really just an extension of summer in Southern California, as we still surf bareback before work and frequent the beach after school in a temperate 70 degrees. The utter lack of shift in temperature and overall energy makes it rather&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/7705ac_4c3a809aef834f7390c8caacd780ec2d~mv2.jpeg/v1/fill/w_1360,h_680,al_c,q_85,enc_auto/7705ac_4c3a809aef834f7390c8caacd780ec2d~mv2.jpeg\" data-is-external-image=\"true\"></p>\n<p><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: Katy Durand</span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Fall is really just an extension of summer in Southern California, as we still surf bareback before work and frequent the beach after school in a temperate 70 degrees. The utter lack of shift in temperature and overall energy makes it rather easy to go with the <em>September issue</em> mentality and align with this idea of new beginnings that poetically comes along with the season fall in the fashion world. However, winter is a different story. </span></p>\n<p id=\"viewer-d9s8p\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Once November 30 hits, the Anna-Wintour-inflicted pressure flies out the window and something happens to Southern Californianites. The orange leaves vanish, only to be replaced by burnt orange Aritzia super puffs and unmotivated individuals buried beneath them. We are suddenly robbed of the light and breezy fall looks we depended on as we fight to brave the cold that is sub 70° weather - resulting in <em>uniforms. Sweatpants and a hoodie. Leggings and a long sleeve. That’s the fifth time you’ve worn that sweater Katy.</em> I am here to say that this winter season, hibernation uniforms are on the naughty list - only large old men who sneak through chimneys are allowed to wear uniforms this winter. So shivering as we may be, let’s keep our fall energy flaunting as the Santa Ana winds blow and we head into Santa season. It won’t be a white Christmas here, but it could be a <a data-hook=\"linkViewer\" href=\"https://www.adidas.com/us/samba-og-shoes/B75806.html?af_channel=Search&amp;af_click_lookback=30d&amp;af_reengagement_window=30d&amp;c=PLA&amp;cm_mmc=AdieSEM_Feeds-_-GoogleProductAds-_-NA-_-B75806&amp;cm_mmca1=US&amp;cm_mmca2=NA&amp;dfw_tracker=24819-B75806-0011&amp;gclid=Cj0KCQiAvqGcBhCJARIsAFQ5ke53rA-N1O1oSbMq-zp4dI_QKztevbRLjsW7thuclQREsz5d60GtPN8aAkj0EALw_wcB&amp;gclsrc=aw.ds&amp;is_retargeting=true&amp;kpid=B75806&amp;pid=googleadwords_temp&amp;sourceid=543457011B75806\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">white Adidas Sambas </u></a>Christmas. </span></p>\n<p id=\"viewer-1ha80\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">This year’s top fall/winter trends that will keep you on track with what’s blowing up in the fashion world, while still remaining feasible for the SoCal local trying to achieve ultimate Southbay chicness:</span></p>\n<h5 id=\"viewer-f8l4m\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Bold Shades</span></h5>\n<p id=\"viewer-ee807\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Ignoring the color palette normally aligned with the fall and winter months, this season we are moving away from hues of horror. Let autumn be ominous, and may winter be filled with a bright palette because if it’s going to rain, we might as well bring the rainbow. Amazon green and yellow are majorly on the scene, with pinks and oranges not far behind.</span></p>\n<h5 id=\"viewer-8vv04\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Ruched Stiletto Boots</span></h5>\n<p id=\"viewer-e70nl\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">You’ve heard about the mid-calf boot, but have you heard about the mid-calf ruched boots complete with a stiletto heel? The lug sole and over-the-knee looks have had their time in the shy winter sun - fairly new on the scene, this stiletto shoe is ready to bask in the limelight as the boot of 2022 winter. The wider opening does not hug your calf, which offers a more flattering side to mid-calf boots. Serving in suede and leather options, the <a data-hook=\"linkViewer\" href=\"https://www.revolve.com/schutz-ashlee-bootie-in-dark-chocolate/dp/SCHU-WZ1074/?d=F&amp;utm_source=pinterestpaid&amp;utm_medium=retargeting&amp;utm_campaign=pinterest_%7Bad+group+name%7D&amp;pp=0&amp;epik=dj0yJnU9YUNaZ3J5YjB3eEJQUnpmZzMwVjlBWDhzUzJpRjBzLVYmcD0xJm49djduNEpKVklVU3pkNnI5WElvWU1OZyZ0PUFBQUFBR09JUUp3\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">Revolve Ashlee Booties</u></a> are a sleek and affordable addition to anyone’s boot collection. Bury me in these boots xx. </span></p>\n<h5 id=\"viewer-d5b97\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Biker Chic</span></h5>\n<p id=\"viewer-290gc\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Leather remains a winter staple, yet it’s been a few years since the classic moto and biker style have been worn by the masses. Add an edginess to any look with motorcycle motives, or a finished touch with a more cozy sherpa leather.</span></p>\n<h5 id=\"viewer-4934r\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sequins</span></h5>\n<p id=\"viewer-eum9b\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Good news - that skirt you’ve had since 2012 can make its debut for more than just a holiday party this year! Never was I an adoring fan of the shimmer and over-the-top element sequins brought; however, this season's flapper-esque influence is intricately everything and can work itself day-to-day looks. <a data-hook=\"linkViewer\" href=\"https://www.neimanmarcus.com/p/paco-rabanne-mirrored-sequin-chainmail-mini-skirt-prod253320071?utm_source=google_shopping&amp;ecid=NMCS_GL_NCXX_XXXX_XXXXXXXXXXXXXXXX_XXXXXXXX&amp;gclid=Cj0KCQiAm5ycBhCXARIsAPldzoWPa4_D1nDIa6DS2tE603S8ZkRdH-UibsvH5lUbIbZKUuq7_INa5voaAg79EALw_wcB&amp;gclsrc=aw.ds\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">Neiman Marcus’</u></a> silver sequin skirt is everything, but it will certainly empty everything out of your wallet, so if you’re ballin’ on a budget or in this case, dazzlin’ on a dime, check out the <a data-hook=\"linkViewer\" href=\"https://www.nordstrom.com/s/sabina-low-rise-sequin-miniskirt/7221852?color=GREY&amp;utm_content=33817189855&amp;utm_term=pla-819472651122&amp;utm_channel=low_nd_shopping_standard&amp;utm_source=google&amp;utm_campaign=662927188&amp;adpos=&amp;creative=145518898258&amp;device=c&amp;matchtype=&amp;network=g&amp;acctid=21700000001689570&amp;dskeywordid=92700049880581803&amp;lid=92700049880581803&amp;ds_s_kwgid=58700005470160253&amp;ds_s_inventory_feed_id=97700000007631122&amp;dsproductgroupid=819472651122&amp;product_id=6067257&amp;merchid=1243147&amp;prodctry=US&amp;prodlang=en&amp;channel=online&amp;storeid=&amp;locationid=9031008&amp;targetid=pla-819472651122&amp;campaignid=662927188&amp;adgroupid=33817189855&amp;gclid=Cj0KCQiAm5ycBhCXARIsAPldzoUW2LxSAEhugvsHTM8R7Up4sacDiHOKRA2vmgKL6RvQ_AyBpGZLwJgaAkmVEALw_wcB&amp;gclsrc=aw.ds\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">EDIKTED’s silver low-rise number.</u></a></span></p>\n<h5 id=\"viewer-3cqr4\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Loafers</span></h5>\n<p id=\"viewer-b643c\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A fall favorite, loafers have yet to give me a private school girl ick and make me feel refined in any outfit I pair them with. Often neutral colors (black, tan, and if you’re feeling really funky: maroon), loafers are a versatile statement shoe pairable with any outfit - whether it be a casual pleated short or a mini skirt and collared shirt combo.</span></p>\n<h5 id=\"viewer-da7f8\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Edgy Preppy</span></h5>\n<p id=\"viewer-f6v16\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">While every it-girl reveled in the “Coastal Grandmother” aesthetic this summer and fall, Grandma is getting a wake up call this winter. It’s time to wave goodbye to our more matronly Massachusetts model and welcome a new side to prep. Ushered in earlier this year by Miu Miu's 2022 Spring Collection, ready-to-wear attire has remained consistent with pinstripes, buckles, and is one of the hottest prevailing trends. Playful, yet effortlessly cool, this vibe takes a contemporary spin on traditional garments, and is achievable without dropping $1,690 on the beloved <a data-hook=\"linkViewer\" href=\"https://www.miumiu.com/us/en/ready_to_wear/skirts/products.Sable_miniskirt.MG1873_92U_F0009.html\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">Miu Miu Sablé miniskirt.</u></a> </span></p>\n<h5 id=\"viewer-4bmto\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Oversized blazers &amp; bomber jackets</span></h5>\n<p id=\"viewer-c4rvc\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">While Southbay winter can get chilly (pause for non-california natives eye roll), most of the time the reality is that it’s not quite cold enough to rock a stylish puffer or sport a wondrous wool coat. But an oversized blazer or vintage bomber can serve as a lighter option for layering in addition to serving some serious street style sass and elevating any day to night look.</span></p>\n<h5 id=\"viewer-bmq2b\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sports Tops &amp; Stilettos</span></h5>\n<p id=\"viewer-a1v2k\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">World Cup, <em>but make it fashion</em>. While unconventional, this trend represents what fashion should be - mix and matching pieces that would never be paired together and styling them so the different energies the pieces elicit compliment each other. The love I have for this look bears similarities to my reaction to last week’s sighting of a sheer tutu styled over basketball shorts, as I thought, “I have to have that look.” With a constant stream of media, trends, and a handful too many Instagram influencers on the scene, I think we are all craving any bit of originality and authenticity we can find.</span></p>\n<div data-hook=\"rcv-block33\"> </div>\n<div id=\"viewer-eigu\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"> </span></div>\n<div data-hook=\"rcv-block34\"> </div>\n<div id=\"viewer-dpge1\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"></div>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Fashion"
            ],
            "date_published": "2023-12-05T22:06:25-08:00",
            "date_modified": "2023-12-05T22:12:24-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/the-red-rose-as-bright-as-the-sun/",
            "url": "https://bayeagle.pages.dev/the-red-rose-as-bright-as-the-sun/",
            "title": "The Red Rose as Bright as the Sun",
            "summary": "It was red, like a rose in a field of weeds. It was dead center, waiting for me to approach the little feet that were her buds, the long hair that were her leaves, and the tiny arms that were her thorns. She was the&hellip;",
            "content_html": "<p> </p>\n<p><span style=\"font-weight: 400;\">It was red, like a rose in a field of weeds. It was dead center, waiting for me to approach the little feet that were her buds, the long hair that were her leaves, and the tiny arms that were her thorns. She was the brightest flower I had ever seen. Her name was Vivian.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">She was so small at the time. She was only two, and I was six. We were cousins, she had the best experience this time of the year. Everyone else was in their own social bubble talking about the most ridiculous things that have ever reached my ears, for me to hear how absurd it all was. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">I could only talk to her, she was the only one who could understand me. She would crawl all over me like a spider on the wall while we were lying down on what seemed like a billion pieces of dog hair on top of the hardwood floor. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">All she spoke was gibberish, but I was able to understand the bundle of words she made up just to make her feel better. </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">She loved the turkey that she ate all the time, little did she know it used to be a screaming bird that would run around like a chicken in a barn. She hated what she called blood, she hated cranberry sauce. But the thing that caught her eye was the chocolate rose cake. Her mouth was filled with a rich muddy brown that only she loved.</span></p>\n<p><span style=\"font-weight: 400;\">          </span></p>\n<p><span style=\"font-weight: 400;\">Vivian was the light at this time. She was more important than the screaming chicken. No one cared about the turkey, just the red rose who ate all of it. </span></p>\n<p><span style=\"font-weight: 400;\">          </span></p>\n<p><span style=\"font-weight: 400;\">We loved Vivian, and she loved Thanksgiving.</span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Original Works",
                   "December 2023"
            ],
            "date_published": "2023-12-05T12:31:46-08:00",
            "date_modified": "2023-12-06T12:10:03-08:00"
        }
    ]
}
