{
    "version": "https://jsonfeed.org/version/1",
    "title": "The Bay Eagle",
    "description": "",
    "home_page_url": "https://bayeagle.pages.dev",
    "feed_url": "https://bayeagle.pages.dev/feed.json",
    "user_comment": "",
    "icon": "https://bayeagle.pages.dev/media/website/logo.png",
    "author": {
        "name": "Bay Eagle Editors"
    },
    "items": [
        {
            "id": "https://bayeagle.pages.dev/literature-form-the-past-to-the-present/",
            "url": "https://bayeagle.pages.dev/literature-form-the-past-to-the-present/",
            "title": "Literature from the Past to the Present",
            "summary": "Fictional literature has always been important to society. It provides us with a way to spread culture, a way to express emotions, and of course, a source of entertainment. However, literature has evolved immensely over the centuries. In comparison to works of older eras, today’s&hellip;",
            "content_html": "<div id=\"contentsContainer\" class=\"style-scope qowt-page\">\n<div id=\"contents\" class=\"style-scope qowt-page\">\n<p id=\"E134\" class=\"x-scope qowt-word-para-0\"><span id=\"E135\">Fictional literature has always been important to society. It provides us with a way to spread culture, a way to express emotions, and of course, a source of entertainment. However, literature has evolved immensely over the centuries. In comparison to works of older eras, today’s literature is quite different due to drastic shifts in societal standards, ideas, living conditions, and morals. These shifts have altered both the content and characters found in important works, since current beliefs heavily influence the popular media of their specific time period. </span></p>\n<p id=\"E136\" class=\"x-scope qowt-word-para-0\"><span id=\"E137\"> </span></p>\n<p id=\"E138\" class=\"x-scope qowt-word-para-0\"><span id=\"E139\">We can track this evolution through what are considered some of the best novels of the 19th to the 21st centuries. A comparison between popular novels of these two time periods serves to display the evolution of literature from the past to the present through historical development. The 19th century is divided into two literary periods, which are the Romantic and Victorian periods. The Romantic period lasted from roughly 1798 to 1837. Literature of this era was fascinated with the beautiful and the grotesque, and was also heavily influenced by political events, such as the French Revolution (Source 1). The French Revolution was a rebellion against the French monarchy that was full of passion, anger, and was driven by a demand for change (specifically for a demand related to an elimination of tyranny). Romantics were also especially interested in human emotion and a sense of excitement related to the natural world and an artists’ creativity. In addition to this, the Romantic period was preceded by the Age of Reason, also known as the Enlightenment, which began in the late 17th century and ended in the early 19th century. During the Enlightenment a new wave of knowledge had recently spread around Europe, and ideas related to rationalism and progressivism were considered to be new ways of thinking at the time (Source 3). New principles, such as the ideas above, are often incorporated into the media of their time period, and so popular literature usually reflects the ideas of the time period it was written in.</span></p>\n<p id=\"E140\" class=\"x-scope qowt-word-para-0\"><span id=\"E141\"> </span></p>\n<p id=\"E142\" class=\"x-scope qowt-word-para-0\"><span id=\"E143\">One example of this concept can be observed in Mary Shelley’s </span><span id=\"E144\">Frankenstein</span><span id=\"E145\">. In this novel, Victor Frankenstein, a young and passionate scientist who is curious about the principles of life, crafts a creation out of various dead body parts and brings it to life. Victor’s creation is hideous, but it has the capacity to think as well as any human can. As soon as he completes his experiment, however, Victor finds himself disgusted with what he has made. The reader learns that the creation only wants love, but understands that it will never be loved because of the way it looks. Out of spite and frustration, the creation kills Victor’s brother and the rest of his family over the course of the novel. While the creation is painted as a monster, Shelley masterfully crafts her characters so that it is impossible to decide who really is the villain: a creation who kills out of frustration, or a creator who is cruel and refuses to give his creation love. This relates to the Romantic period and its principles: a fascination with beauty and ugliness. Victor’s initial obsession with nature and the fundamentals of life are also related to common themes of interest of this era (Source 4). Finally, Shelley’s novel can be somewhat linked to current world events of the century, since a variety of </span></p>\n</div>\n</div>\n<div id=\"pageBorders\" class=\"style-scope qowt-page\" ></div>\n<div id=\"contentsContainer\" class=\"style-scope qowt-page\">\n<div id=\"contents\" class=\"style-scope qowt-page\">\n<p class=\"x-scope qowt-word-para-0 x-scope qowt-word-para-0\">rebellions emerged during the 19th century and the novel essentially describes a rebellion against one’s creator.</p>\n<p id=\"E146\" class=\"x-scope qowt-word-para-0\"><span id=\"E147\"> </span></p>\n<p id=\"E148\" class=\"x-scope qowt-word-para-0\"><span id=\"E149\">The Romantic period lasted until the mid-19th century, and its conclusion marked the beginning of the Vicotrian era of literature. This period of time correlates with Queen Victoria’s rule of England. During this time, industrialism flourished and was a competitive new market, and many countries were transitioning from agricultural societies into rapidly expanding industrial powerhouses. Additionally, ideas from the Age of Reason, such as equality for all and individualism, grew increasingly popular. According to Eastern Connecticut University, a major difference between Victorian and Romantic literature is that during the Victorian era, the steam printing press was developed and helped make the production of texts far cheaper than before. Because of this, all civilians could access literature, and authors had a wider audience to appeal to.</span></p>\n<p id=\"E150\" class=\"x-scope qowt-word-para-0\"><span id=\"E151\"> </span></p>\n<p id=\"E152\" class=\"x-scope qowt-word-para-1\"><span id=\"E153\">An example of this concept is </span><span id=\"E154\">A Chirstmas Carol</span><span id=\"E155\"> written by Charles Dickens. This novel depicts the life of Ebenezer Scrooge, an old man who despises the idea of Christmas and happiness. During the novel, Scrooge is visited by ghosts of Christmas past, present, and future, and each of these presences provides Scrooge with a new perspective. Suddenly, after numerous strange encounters with these ghosts he returns to his bed safely, and decides to take advantage of a new opportunity to redeem himself by finally allowing himself to participate in Chrirstmas festivities (Source 6). An increase in book production due to mass-market steam printing allowed lower classes to afford books. Because of this, Victorian authors were encouraged to include a more diverse array of socio-economic classes in their stories to appeal to a bigger pool of readers. Dickens’ work focuses on the lower class, since many of the supporting characters in the story live in poverty. Because the steam printing press increased access to literature, this novel reflected the new norms of the era.</span></p>\n<p id=\"E157\" class=\"x-scope qowt-word-para-0\"><span id=\"E158\"> </span></p>\n<p id=\"E159\" class=\"x-scope qowt-word-para-0\"><span id=\"E160\">While </span><span id=\"E161\">Frankenstien</span><span id=\"E162\"> and </span><span id=\"E163\">A Chirstmas Carol</span><span id=\"E164\"> clearly reflect the societal norms of their</span></p>\n<p id=\"E165\" class=\"x-scope qowt-word-para-0\"><span id=\"E166\">respective eras, contemporary literature clearly represents the values of the 21st century as well. For instance, </span><span id=\"E167\">The Hunger Games</span><span id=\"E168\"> is a trilogy written by Susan Collins that was inspired by a war in Iraq as well as the Roman gladiators (Source 7). In the first book of this series, Collins describes protagonist Katniss Everdeen, as a girl who lives in a dystopian world with her sister and mother. Katniss lives in a world divided into twelve districts, and every year two children from each district are selected to participate in the Hunger Games (a fight to the death). Katniss volunteers when her sister Primrose is selected as a tribute. Peeta Mellark, a boy from Katniss’s district is also selected as a tribute, and the reader watches a romantic relationship surrounded by tragedy unfold between Katniss and Peeta. Betrayals and sacrifices often occur in this novel, which truly demonstrate the selfishness of mankind and human instinct to physically fight when forced to. This novel is also fictional in almost every aspect, which is another reason this book is reflective of the Contemporary literary era (as experimentalism and creativity are clearly utilized throughout Collins’s work). Additionally, </span><span id=\"E169\">The Hunger Games</span><span id=\"E170\"> was inspired by the Vietnam and Iraq war, two recent political events that certainly influenced the plot of the series. </span></p>\n<p id=\"E171\" class=\"x-scope qowt-word-para-0\"><span id=\"E172\"> </span></p>\n</div>\n</div>\n<div id=\"pageBorders\" class=\"style-scope qowt-page\" ></div>\n<div id=\"contentsContainer\" class=\"style-scope qowt-page\">\n<div id=\"contents\" class=\"style-scope qowt-page\">\n<p id=\"E173\" class=\"x-scope qowt-word-para-0 x-scope qowt-word-para-0\"><span id=\"E174\">As demonstrated, the evolution of literature clearly reflects the evolution of societal values The societal norms of the Romantic, Victorian, and current literary periods are displayed evidently throughout novels written during each era’s specific time frame. As time continues onward, literature will continue to change as the values of society are altered and changed.</span></p>\n<p id=\"E175\" class=\"x-scope qowt-word-para-0\"><span id=\"E176\"> </span></p>\n<p id=\"E177\" class=\"x-scope qowt-word-para-0\"><span id=\"E178\">Works Cited (Unformatted)</span></p>\n<p id=\"E179\" class=\"x-scope qowt-word-para-0\"><span id=\"E180\">1. https://www.easternct.edu/speichera/understanding-literary-history-all/the-romantic-</span></p>\n<p id=\"E181\" class=\"x-scope qowt-word-para-0\"><span id=\"E182\">period.html</span></p>\n<p id=\"E183\" class=\"x-scope qowt-word-para-0\"><span id=\"E184\">2. https://www.bl.uk/romantics-and-victorians/articles/the-romantics</span></p>\n<p id=\"E185\" class=\"x-scope qowt-word-para-0\"><span id=\"E186\">3. https://www.khanacademy.org/humanities/us-history/colonial-america/colonial-north-</span></p>\n<p id=\"E187\" class=\"x-scope qowt-word-para-0\"><span id=\"E188\">america/a/the-enlightenment</span></p>\n<p id=\"E189\" class=\"x-scope qowt-word-para-0\"><span id=\"E190\">4. https://www.sparknotes.com/lit/frankenstein/context/literary/mary-shelley-and-</span></p>\n<p id=\"E191\" class=\"x-scope qowt-word-para-0\"><span id=\"E192\">romanticism/</span></p>\n<p id=\"E193\" class=\"x-scope qowt-word-para-0\"><span id=\"E194\">5. https://www.easternct.edu/speichera/understanding-literary-history-all/the-victorian-</span></p>\n<p id=\"E195\" class=\"x-scope qowt-word-para-0\"><span id=\"E196\">period.html#:~:text=The%20Victorian%20period%20of%20literature,into%20an%20urban%</span></p>\n<p id=\"E197\" class=\"x-scope qowt-word-para-0\"><span id=\"E198\">2C%20industrial%20one.</span></p>\n<p id=\"E199\" class=\"x-scope qowt-word-para-0\"><span id=\"E200\">6. https://www.sparknotes.com/lit/christmascarol/summary/</span></p>\n<p id=\"E201\" class=\"x-scope qowt-word-para-0\"><span id=\"E202\">7. https://www.caldwellschools.com/cms/lib/NC01811136/Centricity/Domain/261/The_Hung</span></p>\n<p id=\"E203\" class=\"x-scope qowt-word-para-0\"><span id=\"E204\">er_Games_and_Mythology.docx#:~:text=Author%20Suzanne%20Collins%20has%20sai</span></p>\n<p id=\"E205\" class=\"x-scope qowt-word-para-0\"><span id=\"E206\">d,footage%20of%20the%20Iraq%20War.</span></p>\n<p id=\"E207\" class=\"x-scope qowt-word-para-0\"><span id=\"E208\">8. https://www.masterclass.com › articles › modernist-literat…</span></p>\n<p id=\"E209\" class=\"x-scope qowt-word-para-0\"></p>\n</div>\n</div>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Original Works",
                   "Hidden History with LaVie",
                   "December 2023"
            ],
            "date_published": "2023-12-26T16:37:16-08:00",
            "date_modified": "2023-12-26T16:38:28-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/supreme-court-ends-affirmative-action/",
            "url": "https://bayeagle.pages.dev/supreme-court-ends-affirmative-action/",
            "title": "Supreme Court Ends Affirmative Action",
            "summary": "In a landmark decision, the United States Supreme Court has effectively ended race-conscious admission programs at colleges and universities across the nation. Chief Justice John Roberts wrote the decision for the court majority, stating that colleges and universities must use colorblind criteria in admissions. The&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">   In a landmark decision, the United States Supreme Court has effectively ended race-conscious admission programs at colleges and universities across the nation. Chief Justice John Roberts wrote the decision for the court majority, stating that colleges and universities must use colorblind criteria in admissions. The court’s six-justice conservative majority argued that admission policies violated the fourteenth amendment’s equal protection clause by discriminating against white and Asian American applicants through its use of race-conscious policies that benefited students from underrepresented backgrounds. For the past 50 years, there has been a divide on the court on the constitutionality of race preferences. Since 1978, the Supreme Court has allowed universities to use affirmative action to achieve a diverse student body. However, when Proposition 209 was passed in California in 1996, state governmental institutions were prohibited from considering race, ethnicity, or sex in the areas of public employment, public contracting, and public education. As a consequence, devastating effects on diversity were felt across institutes such as the University of California, Berkeley and the University of California, Los Angeles who saw a 50% decrease in their number of Black and Latino freshmen (Bleemer). As a result, minorities enrolled in less competitive campuses and were less likely to receive a graduate’s degree and pursue a lucrative career in STEM. Despite more than a half billion dollars spent on outreach and alternative admissions standards, several school officials claim to still fall short from meeting their desired equity and diversity goals. Bleemer’s analysis on these findings “provide the first causal evidence that banning affirmative action exacerbates socioeconomic inequalities” by decreasing the population of students of color at higher education institutions and limiting the opportunities presented to them (Affirmative Action). As affirmative action is a practice meant to favor individuals belonging to disadvantaged groups over similarly qualified non-minority individuals, it remains an essential approach necessary to provide more equitable opportunities to those that suffer from racial disparities.</span></p>\n<p><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br></p>\n<h1><strong>Works Cited</strong></h1>\n<p><span style=\"font-weight: 400;\">Bleemer, Zachary. “Affirmative Action, Mismatch, and Economic Mobility after California’s Proposition 209.” </span><i><span style=\"font-weight: 400;\">The Quarterly Journal of Economics</span></i><span style=\"font-weight: 400;\">, vol. 137, no. 1, 1 Sept. 2021, https://doi.org/10.1093/qje/qjab027.</span></p>\n<p><span style=\"font-weight: 400;\">Network, The Learning. “What Students Are Saying about the End of Race-Based Affirmative Action in College Admissions.” </span><i><span style=\"font-weight: 400;\">The New York Times</span></i><span style=\"font-weight: 400;\">, 21 Sept. 2023, www.nytimes.com/2023/09/21/learning/what-students-are-saying-about-the-end-of-race-based-affirmative-action-in-college-admissions.html#:~:text=Affirmative%20action%20literally%20means%20%E2%80%9Cthe.</span></p>\n<p><span style=\"font-weight: 400;\">“Research and Analyses on the Impact of Proposition 209 in California | UCOP.” </span><i><span style=\"font-weight: 400;\">Www.ucop.edu</span></i><span style=\"font-weight: 400;\">, www.ucop.edu/academic-affairs/prop-209/index.html.</span></p>\n<p><span style=\"font-weight: 400;\">Strauss, Valerie. “Why Race-Based Affirmative Action Is Still Needed in College Admissions.” </span><i><span style=\"font-weight: 400;\">Washington Post</span></i><span style=\"font-weight: 400;\">, 30 Jan. 2022, www.washingtonpost.com/education/2022/01/30/needed-affirmative-action-in-college-admissions/.</span></p>\n<p> </p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "World Events",
                   "December 2023"
            ],
            "date_published": "2023-12-26T16:35:31-08:00",
            "date_modified": "2023-12-26T16:35:31-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/almost-maine-its-almost-here/",
            "url": "https://bayeagle.pages.dev/almost-maine-its-almost-here/",
            "title": "Almost, Maine: It’s Almost Here!",
            "summary": "It is a Friday night in February, a little before 9 p.m. Maybe you are sitting with your loved one, gazing at the stars. You might be catching a drink at the Moose Paddy, or doing some laundry before bed. Maybe you’re ice skating, snowmobiling,&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">It is a Friday night in February, a little before 9 p.m. Maybe you are sitting with your loved one, gazing at the stars. You might be catching a drink at the Moose Paddy, or doing some laundry before bed. Maybe you’re ice skating, snowmobiling, or laughing with your best friend. In the town of Almost, Maine, nineteen townsfolk experience a life-changing event, for the better or worse.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">On November 16th, 17th, and 18th, join Drama for a magical and romantic evening full of love, heartbreak, friendship, and uncertainty. In 2022, NPR reported it as the “second-most produced play in North American high schools”. In a review article from The Kearney Hub, they said, “</span><i><span style=\"font-weight: 400;\">Almost, Maine</span></i><span style=\"font-weight: 400;\"> is about love: sometimes lost, sometimes found but never neatly tied in a bow. It offers lots of questions, few answers, and no ‘happily ever after.’ The best the audience can hope for is a lifted eyebrow, a suggestion of happiness to come, or perhaps the flicker of a moment in which there might be hope for true love. Rich in allegory and metaphor—with characters we all know, situations we’ve all been in, and conclusions that take unexpected turns—</span><i><span style=\"font-weight: 400;\">Almost, Maine</span></i><span style=\"font-weight: 400;\"> says a lot about love…and it speaks in beautiful, arresting and intriguing tones”.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\">As a proud cast member, I can personally attest to the enchanting effect the play provides. It is such a joy to play Shelly, who spends her night hanging out with her best friend Deena after a failed date. I loved being able to explore a more dramatic role, and I love acting alongside my scene partner Annabelle (Deena).</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">The show dates and times are:</span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">November 16th @ 7 p.m. </span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">November 17th @ 7 p.m.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">November 18th @ 2 p.m.</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">November 18th @ 7 p.m.</span></li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 400;\">To get a sneak peek of the play, I interviewed the cast on their experience so far.</span></p>\n<p> </p>\n<p><strong>Q: How did you feel about the rehearsal process? (Context: usually rehearsals are with the full cast, but this year it was only a few cast members at a time)</strong></p>\n<p> </p>\n<p><strong>A: </strong><span style=\"font-weight: 400;\">“I like this specific rehearsal process because since we have so much time in between rehearsals, I have more time to practice everything I learned and master it for the next one. I also think it is a bit challenging and not usual for me to only be working with one person at a time” -Annabelle Varghese, Deena</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I miss being with my cast mates for rehearsal every week, but I love that I can focus on my character and my scene a lot more being separate like this until later. And it makes seeing everyone’s fully polished scene in the end all the more exciting!” -Milo Thomas, Lendall</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“At first, I found it a little odd because I am so used to having group rehearsals and seeing everyone perform. But I do understand why Mr. Sidwell decided to alter it from the norm as it suits the play best and is the most efficient way.” -Isabella Hoadrea, Sandrine</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I liked being able to focus on the scene itself and work with my partner as Milo is one of my best friends. However, I miss the family aspect that being all together brings in rehearsals.” -Emily Dvi-Vardhana, Gayle</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“It was a change from how the shows are usually rehearsed, but I know that having a full rehearsal for your scene will help push the show forward and give us the best results.”  -Josephine Kaiman, Hope</span></p>\n<p> </p>\n<p><strong>Q: What do you enjoy most about your character?</strong></p>\n<p> </p>\n<p><strong>A: </strong><span style=\"font-weight: 400;\">“Lendall is a pretty chill guy and likes to just go with the flow. Things have been seeming to work out, but in my scene, things seem like they might not end up as expected and it builds up to a big moment for Lendall, and it’s really fun to play that. I like that I can find places to connect with my character as well as play those sides that are different from me normally” -Milo Thomas, Lendall</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“What I enjoy most about my character Sandrine is her kindness and understanding despite how pushy Jimmy (her ex) can be during their scene. Her emotions during the scene are so complex but she never truly despises Jimmy for what went wrong which is very admirable” -Isabella Hoadrea, Sandrine</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I honestly really enjoy how aggressive he is. I typically play comedic, lighthearted characters so this is a huge change for me” -Bear Ruedas, Phil</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I like her wittiness, and also appreciate the look into her constant need to be perceived as ‘tough’” -Isabella Gutierrez, Rhonda</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I love how she’s not afraid to admit when she’s wrong, and how she attempts to fix her mistakes” -Josephine Kaiman, Hope</span></p>\n<p> </p>\n<p><strong>Q: How do you want the audience to feel at the end of the play?</strong></p>\n<p> </p>\n<p><strong>A: </strong><span style=\"font-weight: 400;\">“I want them to think the show was funny and entertaining, but I also want them to relate and hopefully find meaning that they can connect to their own lives. This show is about relationships, and deals with love, arguing, romantic and platonic attraction, confusion, and overall, things that everyone has experienced at least once in their life” -Annabelle Varghese, Deena</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“It’s a sweet show that is sort of dramatic with a lot of funny parts too, but I hope that they leave not taking their relationships for granted but remembering to have fun every step of the way. I want the audience to feel charmed in a way” -Milo Thomas, Lendall</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I want the audience to feel fulfilled and happy that all these couples were able to find their way and accomplish their goals throughout the play” -Isabella Hoadrea, Sandrine</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“On the brink of emotional turmoil after going through the emotional rollercoaster that is this play” -Bear Ruedas, Phil</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I want the audience to feel almost perplexed” -Lee Paulson, Pete</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I want them to just sit back, relax, and have a great time” -Elijah Jackson, Steve</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I want my audience to feel mixed emotions about the contrast of scenes” -Elena DiCerbo, Glory</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I want them to wonder what the lives of the couples are like after the scenes” -Annabel Gross, Marcy</span></p>\n<p> </p>\n<p><strong>Q: What is your favorite moment in the play, whether it’s your scene or someone else’s?</strong></p>\n<p> </p>\n<p><strong>A: </strong><span style=\"font-weight: 400;\">“It’s not one moment in the play, but it’s THE moment in every scene. It makes it interesting to know that everyone is having this magical moment “together”. You’ll get it when you go watch it” -Milo Thomas, Lendall</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I agree with Milo, the minute the Northern Lights appear is the most magical moment in the show” -Delilah Shields, Shelly</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I love how it all ties together” -Josephine Kaiman, Hope</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“When Elijah shows up” -Lucas Gribbon, Jimmy</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Taking off my clothes” -Isabella Gutierrez, Rhonda</span></p>\n<p> </p>\n<p><strong>Q: What song best describes your character?</strong></p>\n<p> </p>\n<p><strong>A: </strong><span style=\"font-weight: 400;\">“Bullet In A Gun” by Imagine Dragons - Lee Paulson, Pete</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Bumble Bee” by Bambee - Elena DiCerbo, Glory</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Not Afraid” by Eminem - Scott Moeller, East</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Creep” by Radiohead - Lucas Gribbon, Jimmy</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Midnight Rain” by Taylor Swift - Isabella Hoadrea, Sandrine</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Pocketful of Sunshine” by Natasha Bedingfield - Ivanna Sze, The Waitress</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Love Hurts” by Nazareth - Elijah Jackson, Steve</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Afterglow” by Taylor Swift - Emily Dvi Vardhana</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Isn’t It Romantic?” by Ella Fitzgerald - Milo Thomas, Lendall</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Falling for Ya” from </span><i><span style=\"font-weight: 400;\">Teen Beach Movie</span></i><span style=\"font-weight: 400;\"> - Delilah Shields, Shelly</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“girls” by girl in red - Annabelle Varghese, Deena</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“The Other Woman” by Lana Del Rey - Annabel Gross, Marcy</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“Where Is My Mind?” by Pixies - Bear Ruedas, Phil</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“champagne problems” by Taylor Swift - Josephine Kaiman, Hope</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">“I Don’t Like My Mind” by Mitski - Isabella Gutierrez, Rhonda</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">You can find all these songs on Spotify with a playlist entitled, “almost, maine playlist”!</span></p>\n<p><span style=\"font-weight: 400;\">And after this, start looking forward to our spring musical, </span><i><span style=\"font-weight: 400;\">Mamma Mia!</span></i></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Sources:</span></p>\n<ul>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Josephine Kaiman [Personal Interview]. (2023 October 3).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Lucas Gribbon [Personal Interview]. (2023 October 3).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Bear Ruedas [Personal Interview]. (2023 October 3).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Annabel Gross [Personal Interview]. (2023 October 3).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Isabella Hoadrea [Personal Interview]. (2023 October 4).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Scott Moeller [Personal Interview]. (2023 October 5).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Elijah Jackson [Personal Interview]. (2023 October 9).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Lee Paulson [Personal Interview]. (2023 October 12).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Isabella Gutierrez [Personal Interview]. (2023 October 17).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Milo Thomas [Personal Interview]. (2023 October 17).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Emily Dvi-Vardhana [Personal Interview]. (2023 October 17).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Ivanna Sze [Personal Interview]. (2023 October 17).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Annabelle Varghese [Personal Interview]. (2023 October 17).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">Interview with Elena DiCerbo [Personal Interview]. (2023 October 18).</span></li>\n<li style=\"font-weight: 400;\" aria-level=\"1\"><span style=\"font-weight: 400;\">The Kearney (NE) Hub (2010).</span></li>\n</ul>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Student Life",
                   "December 2023"
            ],
            "date_published": "2023-12-26T16:31:39-08:00",
            "date_modified": "2023-12-26T16:31:39-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/keep-an-ear-out-the-dare-and-yves-tumor-two-unique-artists-you-dont-want-to-sleep-on/",
            "url": "https://bayeagle.pages.dev/keep-an-ear-out-the-dare-and-yves-tumor-two-unique-artists-you-dont-want-to-sleep-on/",
            "title": "Keep an Ear Out: &quot;The Dare&quot; &amp; Yves Tumor: Two Unique Artists You Don’t Want to Sleep On",
            "summary": "One of the most iconic and playful shows took place this past month - wedged in on a random Thursday night right in the heart of October. Yves Tumor brought his band of four to the Wiltern on October 12th, with explosive solo act \"The&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">One of the most iconic and playful shows took place this past month - wedged in on a random Thursday night right in the heart of October. Yves Tumor brought his band of four to the Wiltern on October 12th, with explosive solo act \"The Dare\" as their opener. With the “spooky season” finally making its rounds again, let’s celebrate two absolutely idiosyncratic legends who are quickly capturing the hearts of both electronic and experimental-rock lovers.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://bayeagle.pages.dev/media/posts/9/Screenshot-2023-12-26-161801.jpg\" alt=\"\" width=\"702\" height=\"388\" sizes=\"100vw\" srcset=\"https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161801-xs.jpg 300w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161801-sm.jpg 480w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161801-md.jpg 768w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161801-lg.jpg 1024w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161801-xl.jpg 1360w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161801-2xl.jpg 1600w\"></figure>\n<p><span style=\"font-weight: 400;\">Image credit: </span><i><span style=\"font-weight: 400;\">Drey Phillips</span></i></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Noisy, provocative, and “in your face”, rising electronic act \"The Dare\" immediately illuminated the stage with passionate energy and heavy synths. With a gritty, deep base foundation for his production, \"The Dare\" layers his grounded and playful vocals with feminine samples to fill his music with life and power. The second his blaring set started, all we wanted to do was dance and envelop ourselves in his vibrant performance. If you want to listen to something loud, unique, and honestly kind of weird, keep an eye out for the upcoming LA staple “\"The Dare\"”.</span></p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://bayeagle.pages.dev/media/posts/9/Screenshot-2023-12-26-161847.jpg\" alt=\"\" width=\"648\" height=\"360\" sizes=\"100vw\" srcset=\"https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161847-xs.jpg 300w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161847-sm.jpg 480w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161847-md.jpg 768w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161847-lg.jpg 1024w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161847-xl.jpg 1360w ,https://bayeagle.pages.dev/media/posts/9/responsive/Screenshot-2023-12-26-161847-2xl.jpg 1600w\"></figure>\n<p><span style=\"font-weight: 400;\">Image credit: </span><i><span style=\"font-weight: 400;\">Drey Phillips</span></i></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">No one can command a room like Yves Tumor. His sensationally captivating set pulls you into a wild ocean of sound and power. Deep, electric vocals mixed with a truly vigorous and enticing production left me feeling as if I was happily drowning in his eerie creativity. Every word and breath was delivered with such intention and intrigue, it was impossible to look away when I saw him. </span></p>\n<p><span style=\"font-weight: 400;\">    </span></p>\n<p><span style=\"font-weight: 400;\">Pulling you through years of deeply emotional music, each song felt intensely personal, as if the entire band was opening up to connect directly with each fan. While Tumor was insanely captivating, his band truly resembled a family, persuading the crowd to let their guard down and omit their full attention to them for the entirety of their set. If you love the feel of a tight-knit band with hints of experimentation, dream-like moments, and a loose merge of genres all in one artist, definitely check out Yves Tumor. And even better, as an LA native, take advantage of seeing them live. You won’t regret it.</span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "December 2023"
            ],
            "date_published": "2023-12-26T16:27:20-08:00",
            "date_modified": "2023-12-26T16:27:20-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/a-queens-wardrobe/",
            "url": "https://bayeagle.pages.dev/a-queens-wardrobe/",
            "title": "A Queen&#x27;s Wardrobe",
            "summary": "As we cast aside our summer attire and sift through linty sweater collections, the question of fall fashion rises to the forefront of our collective consciousness. In the classroom, we debate wearing cashmere cardigans versus synthetic sweaters and spar over our positions on denim shorts.",
            "content_html": "<p><span style=\"font-weight: 400;\">As we cast aside our summer attire and sift through linty sweater collections, the question of fall fashion rises to the forefront of our collective consciousness. In the classroom, we debate wearing cashmere cardigans versus synthetic sweaters and spar over our positions on denim shorts. To answer these imminent questions and see beyond fleeting microtrends, this column seeks a fashion oracle.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">The hunt begins with our Homecoming queen, Kaiya Tungyoo. Though her tiara isn’t part of her daily garb, her knit leg warmers and black headphones serve as equally iconic regalia. I traversed the halls with her, from Ms. McNeela to Ms. Adams, sharing snacks and swapping fashion tips and tricks. From her treasure trove of insights, she picked two kernels of knowledge to share with her beloved subjects and the El Segundo High School Bay Eagle.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Despite the sunny disposition of Los Angeles, our queen foresees a season filled with knitted pullovers and thinner reinventions of the traditionally heavy sweater. Whether it be a creative piece, similar to Malina Valentino’s hand-made cropped knits, or a thrifted vintage article, her majesty has her eye on the sweater category. Paired with corduroy pants and sturdy boots, a well-styled sweater could steamroll the cardigan and hoodie in El Segundo’s Fashion Week.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">While I enjoyed wearing smudged black eyeshadow the weekend before Halloween, our resident royalty had a different take on makeup. I peeked into her cart during a trip to the Manhattan Village mall, taking note of which products she recommended. With a fluffy brush in hand, she told me her expectations for the winter: shiny glosses and shimmery eyeshadow which “stay on the chilly side of the makeup color wheel”. Soft blues, silver tones, and pinky blush will star in our resident ruler’s wardrobe, mimicking the flushed cheeks and snowy winter wonderland that never visits the perpetually sunny South Bay. Before we left to finish our AP Calculus homework, Kaiya Tungyoo told me to look forward to seeing her in icy yet cozy looks this winter.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Fashion is fickle, changing faster than the seasons and more drastically than the temperature does from first period to sixth. Despite the sage wisdom our Homecoming queen passed on to this unworthy scribe, I still find myself lost when scrambling into clothes and ransacking my messy closet. The hunt for a fashion prophet will continue for another issue, but for December, I’ll arm myself with the advice of a Homecoming queen, choosing sweaters over zip-ups and blue eyeshadow over black.</span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Fashion",
                   "December 2023"
            ],
            "date_published": "2023-12-26T16:16:52-08:00",
            "date_modified": "2023-12-26T16:16:52-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/go-water-polo/",
            "url": "https://bayeagle.pages.dev/go-water-polo/",
            "title": "Go Water Polo!",
            "summary": "Shoutout to our amazing El Segundo Water Polo team for making it to CIF this year! Luckily, we had the opportunity to interview one of the team captains, Patrick Wang. We first asked him what some of this season’s highlights were, to which he replied,&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Shoutout to our amazing El Segundo Water Polo team for making it to CIF this year! Luckily, we had the opportunity to interview one of the team captains, Patrick Wang. We first asked him what some of this season’s highlights were, to which he replied, “one of the biggest highlights of our season was going undefeated during our regular season, despite the several ups and downs throughout it. Another cool highlight was sour sophomore left Cooper hitting a buzzer beater to win the game during our first tournament, and we also ended up winning all three tournaments we entered this season.” </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">We then asked how he thought this season went. Wang said “the season has gone pretty well, going undefeated and earning the top seed in CIF. Right now we’re focused on that right now. We won our first game yesterday, but we’re still hungry for more.” When asked about the future of the program, he says “we have a lot of talented young guys that can still take this program far. I’m actually excited to see what our team is going to be like in a couple years with our talented underclassmen.” </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">What Wang loves most about this sport “is how much it involves the whole team to be active, as everyone is able to earn their opportunities to score and make some really cool plays.” If you’re interested in joining Water Polo, he would like for you to hear this message: “it’s never too late to join. I started pretty late and ended up being a captain, so it’s definitely possible to do some cool things even with a late start. I would say during this off-season, join a water polo club to get some experience and talk to one of the current players to get you on the list for next season.” </span></p>\n<p> </p>\n<p><span style=\"font-weight: 400;\">Something Wang would like to share with the school is “we are in the middle of CIF right now, and it would be awesome for people to come out and support.” Follow Gundo Water Polo on Instagram to stay updated on game days, times, and locations! Go Eagles!!</span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Sports",
                   "December 2023"
            ],
            "date_published": "2023-12-26T16:00:29-08:00",
            "date_modified": "2023-12-26T16:06:12-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/marine-heat-waves-cause-loss-in-biodiversity/",
            "url": "https://bayeagle.pages.dev/marine-heat-waves-cause-loss-in-biodiversity/",
            "title": "Marine Heat Waves Cause Loss in Biodiversity",
            "summary": "By: Harper Dame Due to the changes in environmental behaviors, there has been a great loss in biodiversity throughout the oceans. Through studies conducted by Professor Fred Wells, from Curtin’s School of Molecular and Life Sciences, Wells claimed that there was a “catastrophic decline” in&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/0c3b9a_499d43868e9b4b8da57cd580d1d250b8~mv2.jpg/v1/fill/w_925,h_618,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/0c3b9a_499d43868e9b4b8da57cd580d1d250b8~mv2.jpg\" data-is-external-image=\"true\"></p>\n<p id=\"viewer-1dfpl\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: Harper Dame</span></p>\n<p id=\"viewer-93tpk\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Due to the changes in environmental behaviors, there has been a great loss in biodiversity throughout the oceans. Through studies conducted by Professor Fred Wells, from Curtin’s School of Molecular and Life Sciences, Wells claimed that there was a “catastrophic decline” in marine biodiversity (Wells, Marine heatwaves decimate sea urchins, molluscs and more at Rottnest). From 2007 to 2021, there has been documented evidence of this decline in wildlife in Radar Reef and Cape Valmigh at Rottnest Island. Since both of these areas were exposed to the warm Leeuwin Current, the animals were placed in contact with increased temperatures. Other reefs, such as those located in the metropolitan area, were not exposed to warmer currents and still maintained sufficient wildlife. </span></p>\n<p id=\"viewer-bc4rg\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Marine heat waves are commonly the cause for the decline in wildlife populations in the oceans. These heat waves exist in periods of abnormally high temperatures relative to the average temperature of the current season. These waves can be brought to a specific area or through larger currents that travel through the oceans. These are known to cause a change in biodiversity dynamics throughout the ocean. Though only small creatures were greatly impacted on the Rottnest Island, this not only impacts their population but the life cycle and food chain within the area. </span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Studies have shown that there has been a greater number of marine heatwaves between the years of 1981 and 2017. Furthermore, approximately 27 major heat waves were recorded and lasted approximately a month. Some of these heat waves even reached temperatures greater than 5.5 degrees above the average sea temperature. Though this may seem like a “tropical climate” or nice for a “beach day”, these heat waves can actually be detrimental to the wildlife in the ocean. Some may not even be able to adapt to these changes fast enough and become extinct. </span></p>\n<p id=\"viewer-5rl0v\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Without a good course of action, our marine ecosystems may not be present for much longer. Since humans have a huge influence on the frequency of these heat waves, they may become more frequent if we do not understand their causes. Due to our carbon emissions and disregard for what goes into the ocean, these heat waves become more consistent. In fact, these are 20 times more consistent due to human interaction. </span></p>\n<div data-hook=\"rcv-block12\"> </div>\n<p id=\"viewer-5vfqm\" class=\"xVISr Y9Dpf bCMSCT OZy-3 cDpYU ok2w4y bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sources:</span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 cDpYU ok2w4y bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Curtin University. \"Marine heatwaves decimate sea urchins, molluscs and more at Rottnest.\" ScienceDaily. ScienceDaily, 24 February 2023. &lt;<a data-hook=\"linkViewer\" href=\"http://www.sciencedaily.com/releases/2023/02/230224134808.htm\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">www.sciencedaily.com/releases/2023/02/230224134808.htm</u></a>&gt;.</span></p>\n<p id=\"viewer-3pirg\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">University of Bern. \"Marine heatwaves are human-made.\" ScienceDaily. ScienceDaily, 25 September 2020. &lt;<a data-hook=\"linkViewer\" href=\"http://www.sciencedaily.com/releases/2020/09/200925113351.htm\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">www.sciencedaily.com/releases/2020/09/200925113351.htm</u></a>&gt;.</span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Science by The Bay with Harper"
            ],
            "date_published": "2023-12-05T22:22:44-08:00",
            "date_modified": "2023-12-05T22:22:44-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/opinion-shacarri-richardson-and-american-airlines/",
            "url": "https://bayeagle.pages.dev/opinion-shacarri-richardson-and-american-airlines/",
            "title": "Opinion: Sha’Carri Richardson and American Airlines",
            "summary": "By: LaVie Saad Sha’Carri Richardson, star professional track and field athlete was allegedly forced off of an American Airlines flight after she refused to hang up a phone call. She claimed that a twenty-two year old flight attendant asked her to leave a call after&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/0c3b9a_493d7be4f0a44e7388f9a9bce5b5dd04~mv2.jpg/v1/fill/w_925,h_561,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/0c3b9a_493d7be4f0a44e7388f9a9bce5b5dd04~mv2.jpg\" data-is-external-image=\"true\"></p>\n<p id=\"viewer-2sdil\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: LaVie Saad</span></p>\n<p id=\"viewer-2am1b\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sha’Carri Richardson, star professional track and field athlete was allegedly forced off of an American Airlines flight after she refused to hang up a phone call. She claimed that a twenty-two year old flight attendant asked her to leave a call after she boarded the aircraft. Though she did hang up as she was told, she told the attendant she did not like his tone and that he should be more respectful. He then proceeded to ask her to show him proof that her phone was on airplane mode and continued to hover, as she describes, over her phone. After she began to record “herself”, the flight attendant backed away (since he was caught in the video as well). He told her she was not allowed to record, to which she replied she believed she felt harassed. Plenty of passengers jumped into the situation, and some even told Richardson she needed to stop. She quickly became defensive and told other passengers that they should not be involved in her business.</span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">I am slightly conflicted about whether or not to support Richardson, since the article paints her as a difficult passenger who is unwilling to follow the rules of the aircraft. This article is from CNN, but it surprisingly does not provide background information or prior context. CNN is known for its reliability (despite its tendency to typically present liberal opinion), which is why I am inclined to trust the article. However, it is important to check both sides (which is why I am curious about what Richardson posted on her Instagram). If I were to only consider the context that we are given in the article, I would say it was reasonable of the flight attendant to ask her to leave her phone call. Knowing that phones that are not on airplane mode before takeoff may interfere with radio and navigation instruments (which can be detrimental and highly dangerous). However, the flight attendant removed her from the plane (which I believe is a mild overreaction, since her phone should have simply been confiscated). </span></p>\n<p id=\"viewer-atqf6\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Another issue I see is Richardson’s career. Since she is a major athlete, any “scandal” that comes her way may damage her career quite a bit. I personally do not believe it is fair when athletes, actors, or even successful businessmen are heavily impacted by insignificant events. However, an issue such as this may be noteworthy to remember. Once again, I believe it all depends on the context. </span></p>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "World Events"
            ],
            "date_published": "2023-12-05T22:21:09-08:00",
            "date_modified": "2023-12-05T22:21:09-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/staff-spotlight-or-marcos-bolanos/",
            "url": "https://bayeagle.pages.dev/staff-spotlight-or-marcos-bolanos/",
            "title": "Staff Spotlight | Marcos Bolanos",
            "summary": "By: Vicken Semerdjian Marcos Bolanos is a teacher and coach at El Segundo High, teaching Economics, and coaching both Cross Country and the Distance Track team. He recently led both the male and female cross country teams to CIF in 2022, and during his time&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/7705ac_663ba3e8913a4de893cf808253d2011b~mv2.jpeg\" data-is-external-image=\"true\"></p>\n<p id=\"viewer-5f78u\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: Vicken Semerdjian</span></p>\n<p id=\"viewer-cses6\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Marcos Bolanos is a teacher and coach at El Segundo High, teaching Economics, and coaching both Cross Country and the Distance Track team. He recently led both the male and female cross country teams to CIF in 2022, and during his time coaching, a team has made it to CIF-SS finals 9 years, and a team or individual from ESHS has gone to CIF state for 8 years. I have had the pleasure of being an athlete under Coach \"B\" for 2 seasons of cross country, and we (the cross country team) think he is a great role model and coach, and has inspired us to go above and beyond in both running and academics.</span></p>\n<p id=\"viewer-11ere\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q: What is the most rewarding part of coaching a high school sport?</strong></span><span class=\"B2EFF public-DraftStyleDefault-ltr\">A: The most rewarding part would be seeing kids grow and mature on a lot of different levels, individually becoming more mature and accountable to a team, understanding how to follow directions, taking on leadership opportunities, and then also doing things they thought they never could. </span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A lot of the student-athletes that I get maybe never did a lot of/were successful in sports, and so running offers them an opportunity to practice and get better every day, and it's awesome trying to help them set goals that at one point they don't think they could ever do; and when they break them, just seeing that huge smile on their face, it's a remarkable feeling.</span></p>\n<p id=\"viewer-qloh\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q:How has Covid reshaped the way you teach and coach in the 2022-23 school year?</strong></span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A: I think the big mindset change that I've seen happen out of Covid is that more people want to keep things fun/casual, and so I'm having to ease up on how much I enforce certain rules and just try to keep perspective of trying to make running fun and making this sport enjoyable, as something that they want to do as a way to relieve stress and get their minds off stuff. </span></p>\n<p id=\"viewer-3b2b1\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Whereas before it was hyper-competitive, and we wanted to make sure that our team was one of the best in the state, which I still do, but the emphasis now is more on trying to enforce personal growth.</span></p>\n<p id=\"viewer-4mej1\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q:What are some of the similarities and differences between coaching and teaching?</strong></span></p>\n<div data-hook=\"rcv-block20\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">A: Some of the similarities are that typically the people you're coaching want to be there, so it allows you to have some more fun, do different things with them, and learn more about the kids. With teaching sometimes, you have to be mindful of the fact that sometimes the kids don't even want to be in your class because they don't like the subject, or something different.</span></div>\n<div data-hook=\"rcv-block20\"> </div>\n<div data-hook=\"rcv-block20\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">In that way they're different, the way that they're similar is that you still want to encourage kids to make good decisions, to work their hardest to be their best, to participate, and to always put their best foot forward.</span></div>\n<p id=\"viewer-7mua4\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q: What are the similarities that a student and an athlete have to have? And would you recommend sports to someone who is mainly focused on academics?</strong></span></p>\n<p id=\"viewer-6n9ri\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A: Similarities that a student and athlete have to have would be a good work ethic, and commitment to try, and by that I mean it's okay to fail; so in running 80% of the time we don't hit PRs(Personal Records), so you're working, then you have to restructure, and go back to the drawing board- Injuries pop up- you'll overcome adversity, and that's no different from what you have to do in the classroom. A lot of the kids that run take hard math classes, and I would doubt that any of the kids get every math problem right the first time; it takes time, you have to keep putting in the work, and the effort, and I think those are the similarities they share.</span></p>\n<p id=\"viewer-d9t99\" class=\"xVISr Y9Dpf bCMSCT OZy-3 _40ACk Ecq9kg bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">I would 100% say that every student should participate in some type of sport. I think that we've missed the mark by not mandating it; I think every kid should be involved in some type of team sport, to teach them how to be cooperative, take direction, learn in a different way, how to be coached, because I think that the things that you learn in sport are probably more applicable to real life than some of the stuff that we learn in the classroom.</span></p>\n<p id=\"viewer-f3sah\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"><strong>Q: Any words of encouragement to students coming into the second semester?</strong></span></p>\n<div data-hook=\"rcv-block30\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">A: Do your best. Always keep trying. Don't look at failure as the final line, look at failure as a launching point. A lot of students are hesitant to try because they're worried about failing, but failure is the stepping stone to everything successful.</span></div>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Staff Spotlight"
            ],
            "date_published": "2023-12-05T22:19:04-08:00",
            "date_modified": "2023-12-05T22:19:14-08:00"
        },
        {
            "id": "https://bayeagle.pages.dev/winter-fashion-in-southern-california-hibernation-uniforms-on-the-naughty-list/",
            "url": "https://bayeagle.pages.dev/winter-fashion-in-southern-california-hibernation-uniforms-on-the-naughty-list/",
            "title": "Winter Fashion in Southern California - Hibernation Uniforms on the Naughty List",
            "summary": "By: Katy Durand Fall is really just an extension of summer in Southern California, as we still surf bareback before work and frequent the beach after school in a temperate 70 degrees. The utter lack of shift in temperature and overall energy makes it rather&hellip;",
            "content_html": "<p><img loading=\"lazy\" src=\"https://static.wixstatic.com/media/7705ac_4c3a809aef834f7390c8caacd780ec2d~mv2.jpeg/v1/fill/w_1360,h_680,al_c,q_85,enc_auto/7705ac_4c3a809aef834f7390c8caacd780ec2d~mv2.jpeg\" data-is-external-image=\"true\"></p>\n<p><span class=\"B2EFF public-DraftStyleDefault-ltr\">By: Katy Durand</span></p>\n<p class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Fall is really just an extension of summer in Southern California, as we still surf bareback before work and frequent the beach after school in a temperate 70 degrees. The utter lack of shift in temperature and overall energy makes it rather easy to go with the <em>September issue</em> mentality and align with this idea of new beginnings that poetically comes along with the season fall in the fashion world. However, winter is a different story. </span></p>\n<p id=\"viewer-d9s8p\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Once November 30 hits, the Anna-Wintour-inflicted pressure flies out the window and something happens to Southern Californianites. The orange leaves vanish, only to be replaced by burnt orange Aritzia super puffs and unmotivated individuals buried beneath them. We are suddenly robbed of the light and breezy fall looks we depended on as we fight to brave the cold that is sub 70° weather - resulting in <em>uniforms. Sweatpants and a hoodie. Leggings and a long sleeve. That’s the fifth time you’ve worn that sweater Katy.</em> I am here to say that this winter season, hibernation uniforms are on the naughty list - only large old men who sneak through chimneys are allowed to wear uniforms this winter. So shivering as we may be, let’s keep our fall energy flaunting as the Santa Ana winds blow and we head into Santa season. It won’t be a white Christmas here, but it could be a <a data-hook=\"linkViewer\" href=\"https://www.adidas.com/us/samba-og-shoes/B75806.html?af_channel=Search&amp;af_click_lookback=30d&amp;af_reengagement_window=30d&amp;c=PLA&amp;cm_mmc=AdieSEM_Feeds-_-GoogleProductAds-_-NA-_-B75806&amp;cm_mmca1=US&amp;cm_mmca2=NA&amp;dfw_tracker=24819-B75806-0011&amp;gclid=Cj0KCQiAvqGcBhCJARIsAFQ5ke53rA-N1O1oSbMq-zp4dI_QKztevbRLjsW7thuclQREsz5d60GtPN8aAkj0EALw_wcB&amp;gclsrc=aw.ds&amp;is_retargeting=true&amp;kpid=B75806&amp;pid=googleadwords_temp&amp;sourceid=543457011B75806\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">white Adidas Sambas </u></a>Christmas. </span></p>\n<p id=\"viewer-1ha80\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">This year’s top fall/winter trends that will keep you on track with what’s blowing up in the fashion world, while still remaining feasible for the SoCal local trying to achieve ultimate Southbay chicness:</span></p>\n<h5 id=\"viewer-f8l4m\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Bold Shades</span></h5>\n<p id=\"viewer-ee807\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Ignoring the color palette normally aligned with the fall and winter months, this season we are moving away from hues of horror. Let autumn be ominous, and may winter be filled with a bright palette because if it’s going to rain, we might as well bring the rainbow. Amazon green and yellow are majorly on the scene, with pinks and oranges not far behind.</span></p>\n<h5 id=\"viewer-8vv04\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Ruched Stiletto Boots</span></h5>\n<p id=\"viewer-e70nl\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">You’ve heard about the mid-calf boot, but have you heard about the mid-calf ruched boots complete with a stiletto heel? The lug sole and over-the-knee looks have had their time in the shy winter sun - fairly new on the scene, this stiletto shoe is ready to bask in the limelight as the boot of 2022 winter. The wider opening does not hug your calf, which offers a more flattering side to mid-calf boots. Serving in suede and leather options, the <a data-hook=\"linkViewer\" href=\"https://www.revolve.com/schutz-ashlee-bootie-in-dark-chocolate/dp/SCHU-WZ1074/?d=F&amp;utm_source=pinterestpaid&amp;utm_medium=retargeting&amp;utm_campaign=pinterest_%7Bad+group+name%7D&amp;pp=0&amp;epik=dj0yJnU9YUNaZ3J5YjB3eEJQUnpmZzMwVjlBWDhzUzJpRjBzLVYmcD0xJm49djduNEpKVklVU3pkNnI5WElvWU1OZyZ0PUFBQUFBR09JUUp3\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">Revolve Ashlee Booties</u></a> are a sleek and affordable addition to anyone’s boot collection. Bury me in these boots xx. </span></p>\n<h5 id=\"viewer-d5b97\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Biker Chic</span></h5>\n<p id=\"viewer-290gc\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Leather remains a winter staple, yet it’s been a few years since the classic moto and biker style have been worn by the masses. Add an edginess to any look with motorcycle motives, or a finished touch with a more cozy sherpa leather.</span></p>\n<h5 id=\"viewer-4934r\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sequins</span></h5>\n<p id=\"viewer-eum9b\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Good news - that skirt you’ve had since 2012 can make its debut for more than just a holiday party this year! Never was I an adoring fan of the shimmer and over-the-top element sequins brought; however, this season's flapper-esque influence is intricately everything and can work itself day-to-day looks. <a data-hook=\"linkViewer\" href=\"https://www.neimanmarcus.com/p/paco-rabanne-mirrored-sequin-chainmail-mini-skirt-prod253320071?utm_source=google_shopping&amp;ecid=NMCS_GL_NCXX_XXXX_XXXXXXXXXXXXXXXX_XXXXXXXX&amp;gclid=Cj0KCQiAm5ycBhCXARIsAPldzoWPa4_D1nDIa6DS2tE603S8ZkRdH-UibsvH5lUbIbZKUuq7_INa5voaAg79EALw_wcB&amp;gclsrc=aw.ds\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">Neiman Marcus’</u></a> silver sequin skirt is everything, but it will certainly empty everything out of your wallet, so if you’re ballin’ on a budget or in this case, dazzlin’ on a dime, check out the <a data-hook=\"linkViewer\" href=\"https://www.nordstrom.com/s/sabina-low-rise-sequin-miniskirt/7221852?color=GREY&amp;utm_content=33817189855&amp;utm_term=pla-819472651122&amp;utm_channel=low_nd_shopping_standard&amp;utm_source=google&amp;utm_campaign=662927188&amp;adpos=&amp;creative=145518898258&amp;device=c&amp;matchtype=&amp;network=g&amp;acctid=21700000001689570&amp;dskeywordid=92700049880581803&amp;lid=92700049880581803&amp;ds_s_kwgid=58700005470160253&amp;ds_s_inventory_feed_id=97700000007631122&amp;dsproductgroupid=819472651122&amp;product_id=6067257&amp;merchid=1243147&amp;prodctry=US&amp;prodlang=en&amp;channel=online&amp;storeid=&amp;locationid=9031008&amp;targetid=pla-819472651122&amp;campaignid=662927188&amp;adgroupid=33817189855&amp;gclid=Cj0KCQiAm5ycBhCXARIsAPldzoUW2LxSAEhugvsHTM8R7Up4sacDiHOKRA2vmgKL6RvQ_AyBpGZLwJgaAkmVEALw_wcB&amp;gclsrc=aw.ds\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">EDIKTED’s silver low-rise number.</u></a></span></p>\n<h5 id=\"viewer-3cqr4\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Loafers</span></h5>\n<p id=\"viewer-b643c\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">A fall favorite, loafers have yet to give me a private school girl ick and make me feel refined in any outfit I pair them with. Often neutral colors (black, tan, and if you’re feeling really funky: maroon), loafers are a versatile statement shoe pairable with any outfit - whether it be a casual pleated short or a mini skirt and collared shirt combo.</span></p>\n<h5 id=\"viewer-da7f8\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Edgy Preppy</span></h5>\n<p id=\"viewer-f6v16\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">While every it-girl reveled in the “Coastal Grandmother” aesthetic this summer and fall, Grandma is getting a wake up call this winter. It’s time to wave goodbye to our more matronly Massachusetts model and welcome a new side to prep. Ushered in earlier this year by Miu Miu's 2022 Spring Collection, ready-to-wear attire has remained consistent with pinstripes, buckles, and is one of the hottest prevailing trends. Playful, yet effortlessly cool, this vibe takes a contemporary spin on traditional garments, and is achievable without dropping $1,690 on the beloved <a data-hook=\"linkViewer\" href=\"https://www.miumiu.com/us/en/ready_to_wear/skirts/products.Sable_miniskirt.MG1873_92U_F0009.html\" target=\"_blank\" rel=\"noopener noreferrer\" class=\"TWoY9 itht3\"><u class=\"D-jZk\">Miu Miu Sablé miniskirt.</u></a> </span></p>\n<h5 id=\"viewer-4bmto\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Oversized blazers &amp; bomber jackets</span></h5>\n<p id=\"viewer-c4rvc\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">While Southbay winter can get chilly (pause for non-california natives eye roll), most of the time the reality is that it’s not quite cold enough to rock a stylish puffer or sport a wondrous wool coat. But an oversized blazer or vintage bomber can serve as a lighter option for layering in addition to serving some serious street style sass and elevating any day to night look.</span></p>\n<h5 id=\"viewer-bmq2b\" class=\"iwbhW Y9Dpf OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">Sports Tops &amp; Stilettos</span></h5>\n<p id=\"viewer-a1v2k\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\">World Cup, <em>but make it fashion</em>. While unconventional, this trend represents what fashion should be - mix and matching pieces that would never be paired together and styling them so the different energies the pieces elicit compliment each other. The love I have for this look bears similarities to my reaction to last week’s sighting of a sheer tutu styled over basketball shorts, as I thought, “I have to have that look.” With a constant stream of media, trends, and a handful too many Instagram influencers on the scene, I think we are all craving any bit of originality and authenticity we can find.</span></p>\n<div data-hook=\"rcv-block33\"> </div>\n<div id=\"viewer-eigu\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"><span class=\"B2EFF public-DraftStyleDefault-ltr\"> </span></div>\n<div data-hook=\"rcv-block34\"> </div>\n<div id=\"viewer-dpge1\" class=\"xVISr Y9Dpf bCMSCT OZy-3 lnyWN yMZv8w bCMSCT public-DraftStyleDefault-block-depth0 fixed-tab-size public-DraftStyleDefault-text-ltr\"></div>",
            "author": {
                "name": "Bay Eagle Editors"
            },
            "tags": [
                   "Fashion"
            ],
            "date_published": "2023-12-05T22:06:25-08:00",
            "date_modified": "2023-12-05T22:12:24-08:00"
        }
    ]
}
